{
    "Algorithmen und Wahrscheinlichkeit": [
        "Super interesting course, with quite difficult topics that are explained exceptionally well. The profs were all great, the script is super useful, the exercise sessions were extremely helpful and the bonus points at perfect difficulty. More or less, exactly how you would want a course to be.However, the exam was a bit harder than expected, especially the written part. It was definitely possible to pass, though hard to get a really good grade. Would definitely prepare a bit more than average for this one.FS23"
    ],
    "Diskrete Mathematik": [
        "A mathematics-heavy and quite demanding course.Investing the time to really get into new mathematics and solve the series can feel insane, but gives insight into 'true' mathematical thinking and a foundation for mathematical logic.The script is one of the best course scripts at ETH, and Prof. Maurer is engaged to introduce its ideas, and also motivate otherwise.HS21",
        "Feels like a lot of content and the exam is very stressful & difficult. I found the lectures & content to be somewhat interesting, though they tended to be a lot easier than exercises/exams. However, there is a good script to use and there are a lot of old exams to practice on.HS22",
        "Really enjoyed it, but definitely do it ONLY IF you are willing to put in the requisite work (Prof. Maurer recommends 9 hours a week of work outside the class, but the reward in terms of amount learnt is very high - note, in actuality nobody does 9 hours a week of work for the course).HS22"
    ],
    "Image Analysis and Computer Vision": [
        "The only good thing for this lecture was the projects during the semester. they had a some TAs you could ask for help and was nice to learn. unfortunately the projects are not to relevant for the exam. Lectures were really bad to the point I stopped attending. Exam was multiple choiceHS22"
    ],
    "Stochastic Methods for Engineers and Natural Scientists": [
        "Overall quite interesting, but one of the more confusing courses so far.The first part is about probability theory and with WuS done, it should be rather easy/repetitive. The second part covers different stochastic and sampling methods with some interesting exercises looking at real world applications (Although confusing, it was my favorite part).There's a script and videos covering the content in the course (self study). The exercises consist of written part and programming in jupyter notebook. Some of them are solved/discussed together in class.The end exam was much different/harder than the mock exam questions I used as my main preparation. Luckily, the grading was very generous in my opinion.HS22"
    ],
    "Cryptographic Protocols": [
        "A theoretical course focusing on secure multi party computation.I thought the content was quite interesting, and the lecturer creates a very relaxed atmosphere of learning without comprimising on the content delivered. The exercise sessions can be hit or miss because of their special modus operandi (you solve that week's exercise sheet in groups and then present those), but you're not forced to attend and the solutions are very clear.You also do NOT need a strong foundation of cryptography or similar. FS23"
    ],
    "Digital Signatures": [
        "This course is what is says on the box. You'll do digital signatures, and only digital signatures. This course is purely theoretical. The script is good, slides are as well. The exercises are kinda meh, but they're fully optional. The lecture itself is also really well taught. If you liked Information Security, you'll probably like this one and vice versa.The Information Security Course is almost certainly a requirement. FS23"
    ],
    "Computational Statistics": [
        "From a Computer Science student's perspective, the content does not have the same depth I was used to in Machine Learning classes. It is more of a practical introduction to how to use R than anything else. You won't learn how the algorithms work or why. You only learn what they do (xy fits a squiggly line). The script is very short and probably together with the exercises enough to do well in this class. I would not recommend this to knowledge-hungry people but if you are interested in an intro to R or a low-effort 8 ects go for it.FS23"
    ],
    "Large Language Models": [
        "Overall it is an interesting course, but a lot of people took it because they expected to learn ChatGPT stuff and then dropped the course after first theory lectures on measure theory. Prof. Cotterell's content is overlapping with Natural Language Processing and Advanced Formal Language Theory courses a lot and the first (theoretical) assignment requires a lot of time and effort to do. Prof. Cotterell can explain the material very well and in an engaging way, but you are very likely to be confused by relevancy of some topics to LLMs in general, however, it was still interesting to learn stuff that he presented. Prof. Sachan and Prof. Tramer's part is more like you would expect from a course called Large Language Models with focus on LLM architectures, finetuning, prompt engineering and fairness. The second (more practical assignment) is much more useful IMO for further work with LLM's if you ever need to use them. The exam is moderately difficult, but overall the course team is always trying to improve the course and help you if you have questions about content or assignments. The course was happening for the first time ever, so it is likely to change next year, but I would still recommend it.FS23"
    ],
    "Lineare Algebra": [
        "Really easy to get a good grade as the exam is virtually the same every year.I would recommend going to the exercise sessions and trying to solve the exercise sheets in order to gain a better understanding for LinAlg, as it is a quite important subject but it is not at all necessary if you only care about your grade.Lectures are really long and not very interesting so I would recommend skipping them entirely.HS21",
        "The lectures are rather boring, I recommend going to the exercise sessions instead. The exercises are doable in a few hours per week. The exams are easy, follow the exact same structure and cover the same topics each year (except for one special topic).HS21"
    ],
    "Grundzüge des Rechts": [
        "I found it a very interesting course that gives a nice overview of certain parts of Swiss law. During the lectures you get to see some of the different law implementations there are in different countries and some reasoning behind why different laws exist. The lectures were recorded, so this course could have been followed remotely. The grade consists of one final MC exam on moodle, which is doable when you watched the lectures and did the \"Kontrollfragen\" (which is a short quiz after every lecture on moodle) and maybe revising the slides once or twice. The exam does have a few tricky questions, but many that should be very similar to the semester.FS23"
    ],
    "Mathematical Foundations of Computer Graphics and Vision": [
        "One of my favourite courses I attended, even though it is one of the more difficult and time intensive courses. From the title of this course, I expected a theoretical and math-heavy course, however a big part was actually how to apply the discussed mathematical foundations in practice and accordingly 50% of the grade are from programming exercises. They can be somewhat time-consuming, especially for 5 ECTS, but to me they were really rewarding, since they helped me understand the theory a lot better. The other 50% of the grade are an oral exam, the contents and structure of which are really fair in my opinion. They focus on whether you have an intuitive understanding of the discussed topics and not if you know the formulas by heart.FS23"
    ],
    "Game Programming Laboratory": [
        "Good fun, would definitely recommend! Making a project in a team like this was a really cool experience. Only real gripe I have with the course is that we were forced to use the very barebones MonoGame (C# game making framework, i.e. a library of some basic functions like sprite rendering and 3D camera utilities), which we often jokingly referred to as MonoPain. I don't think there was much of a point to having to make everything from scratch like this. While the lecturer might say that this gives us more of an insight into game development, I actually feel quite the opposite. Unless you're an engine programmer, you will likely never have to implement a collision- or particle system from scratch. I would much rather have the focus on... creating the actual gameplay. And I feel like the cool ideas everyone had could have been executed much better if we had the liberty to use an actual game engine.FS23"
    ],
    "Computational Intelligence Lab": [
        "CIL covers similar content as the other larger ML courses at ETH. So a lot of the content is not really very interesting. The focus is on analyzing and modelling problems and showing that a wild variety of problems essentially come down to matrix factorization. At the same time, CIL does also cover all the usual ML topics such as gradient descent, NNs, CNNs, AEs, GANs, DDPMs etc. The quality of the lectures is okay but the prof also makes it clear that this course is not a priority for him. The projects are recycled every year while making the baseline harder to account for the increase of computational power and advances in ML in the last decade. The projects are okay but they would be a lot more interesting if they reworked them to give some new options to explore.The exam is a mix of an UZH exam and a normal exam. If you want to solve it like a normal exam, you won't have enough time. So make sure to have all the required formulas on the cheat sheet. FS23"
    ],
    "Physically-Based Simulation in Computer Graphics": [
        "The course content was pretty easy imo. But I'm studying CSE so I already had lots of experience with PDEs and numerical methods. If you're not very familiar with those it might be more challenging. The exam was pretty fair (though you have no practice assignments apart from the slides). The project workload heavily depends on how much you want to invest. If you aim for something up to like a 5.5 it shouldn't be a ton of work but if you aim for a 6 in the project you might have to invest an amount of time that's disproportional to 30% of the 5 credits for the course.HS21"
    ],
    "Optimization for Data Science": [
        "This entire course is essentially a course about variations of the gradient descent algorithm and their convergence guarantees in different theoretical scenarios. The course can be interesting from the perspective that most optimization methods are applied without really considering if and how they work. It also uses various mathematical tools that can be somewhat interesting for people who'd like to do more research into similar areas. But for the most part, the course feels quite repetitive and boring. In the last lecture, the prof also tries to shortly bridge the course to the optimization in practise - which essentially shows that a lot of the course content is pretty pointless in practise. The graded assignments are usually quite hard and require a lot of time. Though, the difficulty of the individual tasks does vary a lot. Some of the tasks are also unsolvable until they fix the task description which can easily take a week or more. Overall, this course is quite boring, requires a significant time-investment and does not really feel relevant.FS23"
    ],
    "Chinesisch I A1.1": [
        "Nice lectures for anybody who's interested in studying Chinese. However, the pace of the lectures is a bit slow, so it feels like less than 3 credits.HS22"
    ],
    "Komplexe Analysis": [
        "I really enjoyed Analysis I and Anlysis II, so I thought this course would be great as an Ergänzung/Minor course, thinking I had a pretty good handle on what I was getting into. It wasn't.The content is interesting (finally learning how exactly Fourier Transform works sounds great) but could have been presented in a more engaging way. The lectures felt like a waste of time.Over all the course was much harder more time consuming than I've expected. Complex Analysis requierd more effort than other 4 ECTS courses like probablity and statistics.To end this on a more positive note: there weren't any negative surprises at the exam, it's easy to prepare for the final exam by grinding old exercises and exams. Also you're allowed to bring a cheatsheet.FS23"
    ],
    "Information Technology in Practice": [
        "This course focuses on economics and the business aspects of IT, which wasn't exactly what I expected. I kinda expected that there would be more concrete examples of technologies that are used in companies and why. However this aspect was covered in a series of guest lectures.I'd say  the quality of the lecure slides is very high, you find all the information you need to study for the exam in them. I would recommend attending the lectures not only due to the absence of recordings, but also because they are engaging and there are lots of opportunities to ask questions and get quality answers. The only negative point when it comes to resources is that there are any solutions provided for the exercises.The course isn't too difficult, but I wouldn't say that it's free credits. If you attend the lectures, pay attention, maybe even take notes and solve the exercises during the semester passing the course shouldn't be a problem.Although the content wasn't exactly what I expected, I've gained some insights into the business side of CS (especially during the guest lectures) and I would definitely recommend it, if you're at least somewhat interested in economics.FS23"
    ],
    "Controversies in Game Theory": [
        "Happened in the last week of the semester (blockcourse) and went from 9-13 (even though vvz said 8-15).In general quite an interesting course, you learn quite a bit about Game Theory and they start from ground up. The profs did their job quite good, some more exciting, some less.The grading is done by an essay/document of about 10 [+/-5] pages (+ slides you won't be asked to hold) with a group up to 5. Though, they were quite open to stretch any limits. For writing this you only had 12 days, but it shouldn't be too much effort/time depending on what you aim for. The topic was completely free for you to decide, just needed to be somehow relevant to Game Theory.Course Website: https://coss.ethz.ch/education/controversies.htmlFS23"
    ],
    "Advanced Machine Learning": [
        "Interesting course, not hard, doesn't require too much effort, great project system which makes you learn a lot :)",
        "While I can say many negative things about AML, I still believe that it gave me a good overview of what ML has to offer. You look at a wide variety of topics. A lot of the topics are similar to IML, however, they are treated a lot less superficially and I learned a lot imo. Furthermore, you actually need to understand (most of) the proofs and they are actually asked in the exam, which I really liked but that is very subjective. Just keep in mind that this course requires a lot of self-study and looking things up online. I did not profit much from attending lectures or exercise classes, but that again is very subjective. The projects are a rat race and are pretty toxic in my opinion since they are graded competitively. If you are a competitive person, willing to spend your weekends/ late nights tuning hyperparameters and searching the internet for new models to add to your ensemble, then you will learn a lot and can do really well in the projects. The knowledge acquired will also translate to other ML courses, Datathons etc. Last year, in the first project you could place very well by just using the CPU nodes on euler. However, in the second project, the top teams used neural networks which could only be properly trained on GPUs, which AML does not give you access to. Even as a person who has access to GPUs, I share the opinion that this is really unfair, but not atypical for ML courses at ETH. Like every ETH ML course, they don't teach you the practical stuff. I recommend that you learn the basics of the bash command line and how to run your ML models on Euler not only for this course but also for your future ML courses, your project teammates and your job. HS22"
    ],
    "Automated Software Testing": [
        "The lecture in this course is interesting, but quite surface level. I was already familiar with many topics mentioned, from my bachelors. While I enjoyed attending the lectures in person, I believe reading the slides and watching the recordings if necessary would be very doable in this course. There is a mid term exam after the first half of the semester. The lectures continued after that with guest lecturers, but I opted not to attend them as the content would not be tested anymore.I felt like the exam was quite fair.In addition to the exam there were three graded assignments and a large project which was done in groups of two.The assignments were somewhat time consuming, but extremely easy. They were essentially always structured in a way where you had to follow some README guide and \"use\" some software testing program (gcov, KLEE, and AFL). I say \"use\" in quotes, because you barely had to think for yourself and could mostly just follow the README guides. The most challenging issues were often dependency conflicts or just when something didn't go as described in the README.For the project they suggested a number of topics from which we could select. We were then assigned a supervisor and worked quite independently from there. I found it really interesting to create a software project from scratch with some practical use. I think the amount of work invested into the project will vary quite a lot between different groups.FS23"
    ],
    "Informal Methods": [
        "I'll start by saying that I personally did not enjoy the course, but I'll try to give a fair assessment of it.Communication from the prof and teaching staff was poor, one week they were all sick, but didn't bother informing anyone that the lecture was canceled. Maybe a one off, but really rubbed me the wrong way. Then again, for the final assignment they extended the deadline by one week, but only one day after the initial deadline had already passed. This was during HS22.On a positive note, the prof tries to make the lectures quite interactive, lots of interactively solving problems at the blackboard during class.  There are homework assignments (I think more or less weekly) that are not graded, I did not solve those because I was short on time.Then there were three graded assignments and those were quite intensive and I personally had trouble understanding what they expected the answers to look and be like. If you put in the time, they are however quite doable, I ended up skipping the final assignment almost entirely as I had a lot of other things going on when it was due (again, they extended the deadline of that specific assignment by a week. that could have been quite helpful if I had any more time available during that week, which I unfortunately did not).I am unsure if the ungraded homework assignments would have been good preparation for the graded assignments and if they would have made it easier to understand how to formulate answers.As far as the content is concerned, it felt quite tedious. In the end the course teaches you how to carefully analyze some code to proof some desired properties about it or spot bugs in the code; think Hoare triples and invariants.HS22"
    ],
    "Reliable and Trustworthy Artificial Intelligence": [
        "The course and its contents are very interesting and extremely new. Big parts of the content are research from recent years and at the forefront of the field. But this also means that the course structure changes quite a lot from year to year and it doesnt feel refined yet. The project was a huge amount of work and very hard for me who didn't take any advanced ML courses yet. The exam was also comparatively very difficult with the grading being somewhat nice, but not overly nice.Overall, if you like the field and have some solid experience with ML (beyond IML), I think this can be a very interesting course, but be aware of the high workload and difficulty.HS22"
    ],
    "Programming Techniques for Scientific Simulations I": [
        "The course of Mr Käppeli is held in a small circle which makes it more a seminar than a lecture. As such, it is a really enjoyable subject. The lecturer loves to discuss with students and also involves them. The effort needed is appropriate.Be aware that you should be familiar with C++ before taking this course.HS22"
    ],
    "Numerical Methods for CSE": [
        "This course needs more effort than the proposed 9 ECTS points. Yes, it is very interesting. Yes, the resources of it are very exhaustive. But this also means that a ton of work is being thrown at you. So: Take with care. And if you have to: good luck.HS22"
    ],
    "Algorithms and Fairness": [
        "time investment: two days (block course style, each ~8hrs), time for writing final paper & going through readingsgrading: based final paper (major part) and class participation (only if improves overall grade, otherwise not considered)experience:>quite a relaxed course, instructor is nice, readings (which are meant to be read before two days in-person sessions to discuss them) are a ton (don't invest too much time reading all of them, because during class we didn't invest that much time on going through them, maybe pick a few to go through them in detail to be able to show participation & remaining ones just skim/ find summary online>don't underestimate the final paper (which is 1.5-2.5k words) because it takes time, for first draft I spent two days on it>in beginning you need to submit a short reaction paper to secure your spot, it is graded on pass/fail & doesn't count for the final grade, but only for getting inwrite it relatively fast & don't spend too much time on itsyllabus & personal course notes: DM medisclaimer: all just based on personal experience, check grading policy when u enrol "
    ],
    "Machine Perception": [
        "The topics introduced are quite interesting. However I felt like the lecture didn't do a great job at giving an understanding for them. The exercise sheets often had unclear questions and were therefore hard to solve. They do not provide old exams because they claim the content changes too much. They have at the same time provided almost the same mock exam as preparation for years. As my second ML course after IML, I had a tough time grasping all the different models introduced. By the time the exam came around the week after the semester I felt quite underprepared, part of that is definitely on me as I should have recognized that earlier, but part of that is also a lack of material to prepare for the exam. I invested significant time into the weekly exercise sheets and as stated often had a hard time with them. The questions on the exercise sheets were often in a different style to those in the mock exam and then also the actual exam.FS23",
        "This course is essentially Introduction to Machine Learning 1.1. It teaches everything from gradient descent, training ML models, NNs, CNNs, RNNs, VAEs, Autoregressive Models, Diffusion Models and Reinforcement Learning. It's quite likely that you've seen all of the content in the other courses - but if you have not, it might be decently interesting to expand your knowledge on ML architectures. The professor does not have time for this course for personal reasons. Unfortunately, this reflects in the poor quality of the lectures and the material in general. Some of the lecturers are okay though. But the lectures generally have a lot of pictures/videos and not much value in terms of actual content. While I do appreciate them showing the practical results, they really only touch all topics superficially and are unable to elaborate on in-depth questions when asked.The exam is feasible but it's not really about understanding the topics. So overall, I'd advise against taking this course because it's really just not enjoyable - especially if you've previously taken an ML course such as e.g. IML.FS23"
    ],
    "Informationstheorie": [
        "This course serves a good basis between probability theory (WuS) and ML (IML). It lets us look at probabilstic modeling from a different view using entropy. Also, the assessment was 3 exams during the semester, with no exam session exams. However, the support from the lecturers and TAs are lacking. The TAs were not well prepared (there is only 1 exercise class) and the material given to prepare for the exams was minimal and not reflective of the difficulty of the exam. The structure of the course was also questionable but not not understandable.Still the course is graded very liniently, and is very chill overall. FS23",
        "Disclaimer: This course was offered for the first time when I took it. Most likely, there will be some changes made.This is an introductory information theory course, meaning you will learn about concepts such as information, entropy, and channels. All these concepts rely on probability theory and statistics. So if you don't like probability or don't feel comfortable working with them the lecture could be confusing sometimes. However, you rarely need advanced concepts. The course is more a broad overview than a formal introduction. Proofs are often rather handwavy and vague.Professor Hofmann is a great lecturer and seems to enjoy teaching the course. The main problem with the lecture is the exercise sheets and their solutions. Over the semester there are three exercise sheets, one for every exam during the semester. The solutions often contained a lot of mistakes and the exercises sometimes used confusing notation that wasn't used in the lecture/script.During the semester there are three exams that are rather calculation heavy and don't ask more high-level questions. I didn't expect this, so I was surprised during the first exam. The grading however was really generous. There is also the option of writing a short paper (2-3 pages). The final grade is the average of the three best results out of the three exams and the term paper. Overall, I would recommend the course if you're looking for an introductory information theory course. The only downsides are the exercise sheets and maybe the exercise sessions in general.  FS23"
    ],
    "Digital Society: Ethical, Societal and Economic Challenges": [
        "I'm a bit ambiguous on this course but I believe it's ok to take.Digital Society follows a seminar format, so the content changes every year and depends almost entirely on the students and their presentations. In my year we had a big ethical focus and talked about AI although it isn't the main topic of the course.Presentation topics can be chosen based on papers provided by the prof and you might also choose own topics - if the prof approves it.The workload isn't that high, but you should still invest some time in the mandatory presentation.At the beginning of the semester I wasn't that interested in the topics, but it turned out to be ok in the end. Even though there weren't many Computer Scientists, the topics which are discussed are still related to CS but obviously from the social viewpoint which gives an interesting insight. "
    ],
    "Power Market I - Portfolio and Risk Management": [
        "I found it to be quite interesting, there is a big focus on the economic side, less on the technical I'd say. Almost all lectures were recorded (with some exceptions). We also went on an excursion to Axpo including a tour to their trading floor. The course felt a bit like a GESS, but with 4 instead of the typical 2 lessons. But that might be the same for all electives, I don’t know."
    ],
    "Software Engineering": [
        "Great course over all. The group project (50% of your final grade) does take quite a lot of time but is also the most fun I had in any of my courses during that semester. The content of the lectures is not very difficult and more on the practical side. Also, the three lecturers are very nice people and have a pleasent style of teaching (and they provide all recordings!)"
    ],
    "Klimasysteme": [
        "I took this course as an elective course. I'm studying RW/CSE so this was a very different experience to all my other courses. No math, no exercises, no projects, only slides and speakers. The moodle exam is more or less open book (pdf summary without limit on number of pages). The entire course is basically a collection of individual talks. The main organizer Dr. Lukas Gudmundsson is IMO quite a boring lecturer. However, he only teaches 3 out of the 12 weeks. The rest are usually specialized speakers who talk about their own field of research which was often very interesting. While the type of content can be quite new for people like me with a much more technical background (compared to the USYS students next to you), the amount of work for the 2 semester exams is similar to that of an average GESS subject and therefore more than fair for the 3KP in a non-GESS category. Plus you have one less exam during the exam session."
    ],
    "Computational Semantics for Natural Language Processing": [
        "good:no examproject is fun and you get to learn a lot about using LLMs or making a datasetbad:assignments aren't beta tested and have a lot of unclear questionsthe organization is very bad, prepare to send a lot of emails/moodle posts for basic things like how many teammates you're allowed to have in your project, or where to hand-in the mandatory thing"
    ],
    "Rigorous Software Engineering": [
        "Interesting topic. The project worth a small part of the grade takes a while to read into, but once you get what they want it becomes quite simple.The exam can be quite stressful time-wise.FS23",
        "I did not enjoy this lecture at all. It lies right in the spot between practice and theory, where the theory isn't interesting enough on its own but isn't practical enough for me to pay attention to. Additionally, the teaching could be better. Dr. Bugariu did a decent job but had to teach the most tedious parts. Dr. Schwerhoff was a great lecturer, and I really enjoyed his part. However, the parts Prof. Vechev taught I did not enjoy at all. He is funny, but his teaching is often incoherent and extremely hard to follow. This is a problem, because he teaches the most important part of the lecture.Additionally, he randomly picks students to answer his questions and often asks the same student for the entirety of the lecture, which seems rather mean. The project only has something to do with the lectures in theory, because the parts explained in the class are already implemented by the various poorly documented libraries. Thus, the project is more about figuring out how to put the libraries together. Maybe this is supposed to be the software engineering part. The exercises prepare you for the exam, so solving them during the semester is worth it. I only attended two exercise sessions, but visiting them might be worth it.FS23",
        "I wasn't really interested in the course at the beginning, I just needed some more ECTS. However it was better than I expected.Contrary to what the name suggests most of the content is very theoretical. There is also a more hands-on part in the form of a mandatory project. The project becomes genuinely enjoyable once you figure out what's going on (this might take some time...).The exercises do a good job at preparing you for the exam.FS23",
        "Warning, I have the least amount of interest in this topic, I just took it because I needed it for the credits.Vechev is a nice Prof, but his teaching wasn't very coherent IMHO.Malte Schwerhoff taught much better, some of the best teaching I've seen at ETH, I only watched lectures, but it was very easily understood.The exercises were relevant to the exam.The project is a huge pain in the ass, but you can do it. The documentation is so so, there is little help and you find very little documentation, the TA's don't help.So I did not find it interesting at all, but it's one of the better taught courses, if this interests you or you have the choice between this and other classes that don't interest you, I'd go for RSE."
    ],
    "Seminar on Randomized Algorithms and Probabilistic Methods": [
        "In this seminar, newly published papers of the Symposium on Discrete Algorithms are presented. Those papers are extremely theoretical, most of them are rather ugly, the quality of some is questionable at best and overall it's very hard to make those papers presentable. Most of them are not relevant in practise which is also quite unfortunate. The seminar is led by Prof. Steger which is of course extremely nice but that doesn't really compensate the downsides.FS23"
    ],
    "Bachelor-Arbeit": [
        "I can recommend the Information Security Group. They were very helpful and relaxed about the thesis. Expectations were very reasonable.I had a meeting every other week and close to submission every week, but I think one could ask for more (or less) meetings. Regular meetings help staying on track so I recommend at least every other week.They were very flexible about the dates of submission and presentation. I recommend at least a week to prepare for presentation (I made the mistake of having only 3 days to prepare and it was very stressful). They are also very fast about grading (at least in my case). They told me the grade right after the presentation and it appeared in mystudies a few hours later."
    ],
    "What Kind of AI Do We Want? Bringing Artistic and Technological Practices Together": [
        "The course was a week of mandatory attendance for 2 credits. We dived into how AI is being used to create texts and art and how this plays a role morally. At the end of the week we had to hold a presentation about some concept we had to come up with. But I feel like nobody really knew what they were on about and just mentioned some buzzwords.For the amount of effort and the credits it gives, I find it is very worth. There was even a big queue to get in. But for the content itself it's not very scientific and more conceptually focused.FS23",
        "This course is basically a one week back to school experience. Basically 0 workload and relaxed setting.3 days à 6h of lecture where only attendance counts. Last day is about 3h of group work and 3h of presentations. To be honest, most students didnt pay attention at all and merely focused on doing other subject's HW. The course in itself is rather interesting albeit disengaging. Probably the easiest 2 credits one could get.But beware that you'll miss 4 days worth of the other subjects so enroll with care.",
        "If you are just looking for credits this is likely the easiest two credits you are ever going to get. The content has a not insignificant focus on art, which to me was not really interesting. However the AI topics are mostly interesting, but focused on ethical aspects.Generally the topics seem drawn out as if they were struggling to fill the time. Time wise its 4 days from 10-5 with a one hour lunch break and a few shorter breaks scattered throughout.The final project was pretty cool as you get to explore basically anything that appeals to you as long as its roughly within the bounds of AI and bias.If they implement the feedback they got, such as people from industry presenting their opinion and making it more interactive, the course would be even better and more engaging then it is now.FS23",
        "Its 4 days and about 6h each day where one has to be there. As for effort you wont find anywhere at ETH a course giving better ECTS/workload ratio.At times the lectures lose the \"roter faden\" but they are actively trying to improve on it for next year. Also the style is more relaxed like in a school which at times is nice to have not something fast paced.At the end of the day there are still a few things one can take away from this course even if one isnt working much with AI in general.So yea if you need 2 ECTS in your planning this is the course to go."
    ],
    "Network Modeling": [
        "As a Computer Scientist:I would say the course has very interesting content, but can be quite tricky if you did not have statistics yet, a course like Algorithms and probability is sufficient but requires some getting used to.The effort in general is higher than in other GESS subjects, tho the practical programming is very interesting (at least for me), the theoretical part is as usual more understand no proofs and not super difficult."
    ],
    "Weltpolitik seit 1945: Geschichte der int. Beziehungen (ohne Uebungen)": [
        "For me the course was really interesting. The course captures the history from the end of WW2 until the present day (Ukraine). The professor is very competent and a good presenter.There is a \"Disskussionsforum\": In a first part, everyone has to hand in a short essay about a thesis. In the second part you will have to write a response to an essay.There is a written exam at the end. The questions are open and similar to those in the Disskussionsforum."
    ],
    "Natural Language Processing for Law and Social Science": [
        "While the course is offered as an elective or GESS course for BSc in computer science, the lecturer announced during the first week that the course is intended for a MSc or PhD level. This left a sour taste from the beginning. There are weekly assignments that are quite time consuming, and the coding templates (Jupyter notebooks) had quite a few dependency conflicts despite there being a \"requirements.txt\" file that should install all the correct dependencies. When I took the course it was offered both in person and through Zoom. Due to frequent technical issues, mainly sound related, the Zoom experience was a lot worse than the in person one. Attendance is required for this course, which adds to the high time commitment. The lecturer \"offers\" additional assignments if one has to miss a lot of lectures. Besides the weekly assignments, students have to write a few essays throughout the semester, which include submitting a draft, peer grading other essays, and reworking the draft based on feedback from other students. At the end of the semester there is a take home test.As a positive the course show cases a lot of natural language processing tools and libraries. The coding assignments can be done without much prior NLP knowledge, but this might have contributed to my assessment of the workload being way too high."
    ],
    "Time Series Analysis": [
        "This is a typical math course. Sometimes it was hard to understand why we were proving certain things or what those theorems were actually useful for. However Prof. Meinshausen is a good lecturer and he also did some examples in R.During the semester there were only two exercise sheets and one page of a previous exam. This made it really difficult to prepare for the exam. And was definitely not enough.The exam is multiple choice and there were no negative points. The first three exercises (roughly 40% of the exam) were really straightforward. Because of the structure of the exam passing was not very difficult.HS22"
    ],
    "Fundamentals of Mathematical Statistics": [
        "I took the course because I liked the course Probability and Statistics in the computer science bachelor and wanted to deepen my knowledge in this area. From what I've heard, the people taking this course are from the mathematics bachelor, the statistics master or the data science master. This means the course has students from multiple backgrounds and therefore the mathematical content is not completely rigorous. However, in many instances I felt really lost, because in order to understand the proofs fully, I would have needed a much bigger background knowledge in probability theory and/or even measure theory. Teaching StaffI only attended one exercise class (was not that helpful). Therefore I cannot say anything about how good the TAs are at explaining the content if you ask them directly about it. The TAs were not responding to any of my emails, which is not appropriate in my opinion. ResourcesThe course has a script which contains almost everything about the lecture. Some proofs where written down on the black board a little bit more detailed in the lecture than in the script. Even though the script covers everything, the proofs were hard to follow because in their derivation not every step follows from the preceding one. This meant I had to fill the holes myself and this made me more unsure, if I really understood the argument (this is where a strong probability background would have helped a lot). Exam TipsThe script is your friend! Try to understand everything the professor wrote down as being exam relevant and make sure you can actually write down the derivation of the proofs and the examples. The exam always has six exercises and three of them where actually not that hard to solve in my opinion. These include the topics about exponential families, UMVU estimators, testing theory and the linear model. If you want to pass the course without much effort, you should try to be able to solve these exercises. On the other hand, to achieve a very good grade you probably need to be able to memorize most of the proofs + examples from the script.TLDRInteresting content, but requires a strong background in probability theory/measure theory to understand everything. Teaching Assistants did not respond to any of my emails and the prof made a mediocre job at explaining the content. The exam is doable and graded nicely. "
    ],
    "Analysis 3": [
        "The topic of this curse is different kinds of PDEs (elliptic/hyperbolic/parabolic, conservation laws, heat eq, wave eq, Possion/Laplace equation) and how to solve them (with the method of characteristics, separation of variables etc.) from an engineering perspective. I cannot say much about the lectures themselves since I almost never attended them due to them being the only course on that day, I studied with the lecture notes and my ta's notes.There is a lecture script (the mentioned lecture notes) which is sometimes a bit hard to understand, it is not written very intuitive. Exercises are definitely exam relevant and the later ones took up to 2 hours for me, but they are useful to help you understand stuff. there are no old exams published besides a mock exam, but in one of the few lectures I watched, Iacobelli (lecturer) mentioned the exercises/mock exam are what is asked in the exam. the exam itself this year was long this year (at least for me), I got through most of the exercises in the 3 hours without going through anything twice. You can take a cheat sheet without any exercises of the course and a specified book for the exam"
    ],
    "Contract Design I": [
        "relatively easy to pass, do not pay for any videos, the prof is not too transparent that it is free. interesting for people interested in economics and law. The course states the obvious from time to time. you watch 30 mins videos and then answer 10 mins some questions. this 2 times a week. + 2 times 2 hours per week of lecture. ",
        "I support everything mentioned in the other review. I just wanted to add that sometimes when seeing the solutions of the minitest and hearing the prof's explanations I was still not at all convinced of the solution. I.e. some questions seemed to me as if one could argue both cases but the prof decided that one side was correct and that's the answer that gave points.HS22",
        "The course is very light on workload and near imposible to fail if even a little bit of time is spend (Way less than 3 ECTS). Course content is somewhat interesting, however the course structure could be done better. For example before each lecture there is a graded miniquiz which is about the content that had to be read beforehand and will be discussed in the lecture. This way however the lecture often felt obsolete.Also whats nice the course only runns for 1/2 of a semester (about 7 weeks).PS: Be carefull the Prof tried to sell the script to ETH students for 50.- without any mention about it in Mystudies/VVZ which is legaly binding and against ETH regulation."
    ],
    "Computer Vision": [
        "The coursework projects are very interesting, but I especially recommend watching the lectures and supplementing with outside resources, as it can be quite hard to learn from some of the slides. For Marc Pollefeys' content (taught in lectures 10-13), the slides were largely formulae with little to no explanation. To actually understand his slides, you also need to study a few hundred pages of a dense textbook about multiple view geometry. Said textbook was the basis of those slides. Some of Fisher Yu's slides, particularly those which are just images, could also do with more written explanation. I have no issues with Siyu Tang's slides and enjoyed them very much. There are 6 assignments, most of which have 2 weeks to complete. Keep this in mind. The exam in January 2023 also seemed (at least from my perspective) much harder compared to previous exams. Fortunately, I still passed. Would I recommend it? If you are truly interested in computer vision, yes. However, it is a challenging course to say the least. "
    ],
    "Algorithms Lab": [
        "Algolab is a very enjoyable course. The entire course consists of implementing code that solves some problems. The setup is essentially the same as with A&D and A&W programming tasks. Algolab does NOT depend on APC. I invested roughly 75 hours to solve the exercises during the semester. When adding the time spent on the tutorials, assessments, exam preparation and the exam, it took me slightly less than 120 hours which corresponds to 4 credits. Solving the exercises was very fun. It is occasionally challenging but as you have a lot \"small\" tasks and not a small number of large projects, the positive feelings when completing a task dominate the overall sentiment. This is generally great; you can just sit down for a couple of hours and really see the progress. When people talk about  Algolab, you often hear a lot of negative stuff (especially from people who didn't take Algolab). One such topic is C++. I did not know any C++ beyond what I've \"learnt\" in NumCSE. Wasn't an issue at all. Another thing is the exam being 2x5 hours. People talk about this as if it was a threat - but it's actually the other way around: They offer you a lot of time so you can solve the tasks instead of forcing you to race through the exam and hope for the best. Furthermore, one third of the exam consists of problems you have solved before and the passing grade is at roughly 40%... so you basically get a passing grade for free. So overall, I would really say that it's one of the best courses there is.HS22"
    ],
    "Concepts of Object-Oriented Programming": [
        "The content is not very hard, the exam is corrected harshly though: You're under time pressure but every mistake you make will be relevant and everything ambiguous will be interpreted against you.The content is interesting though, however it's a lot less practically relevant than you'd expect. E.g. instead of Rust ownership, the lecturer comes up with his own (lacking) type system and then operates inside these rules. However, all in all the exercises are interesting, the tutorial sessions have been great, the lecture has actually good slides to look at independently (that's unusual for ETH. But in turn there are no livestreams nor recordings...), and the lecture itself is slow and low on content but the lecturer is mostly successfully trying to be funny by mocking programming languages.I would have wished for more context about why language designers make their decisions and more weird things for existing real programming languages. And in turn for less abstract concepts that have faults and then discussion only within those frameworks."
    ],
    "Schweizerische Aussenpolitik": [
        "If you are interested in Swiss politics then I highly recommend this course. The lecturer is extremely highly qualified and often invites very interesting guest lecturers. No resources apart from the lectures themselves though and the exam is just straight up 90mins of answering questions about Swiss foreign policy in long text form."
    ],
    "Human Factors I": [
        "Was quite interesting, chill course. Note that it is flipped classroom so you have to watch lectures on video (usually 90mins) and then can optionally attend the weekly Q&A (usually ~20mins). Not too much effort. You only have the slides and very few exercises (which where useless in my opinion) so definitely lacking in resources you have. Exam is open book, you can bring any amount of notes with you but no internet or electronical devices."
    ],
    "Visualization, Simulation and Interaction - Virtual Reality II": [
        "Similar in style as VRI and has some overlapping topics. The courses aren't dependent on each other to so you can do it even without VRI. Goes well together with Visual Computing since they have some similarites with different focus. The oral exam is very chill and the prof is nice."
    ],
    "Quantum Physics for Non-Physicists": [
        "Exam was relatively harshly graded in my opinion. The course itself is quite exotic and interesting but be ready for a lot of applied linear algebra and analysis. The math itself however is quite unrigorous and many things are not properly mathematically justified. "
    ],
    "VLSI 1: HDL Based Design for FPGAs": [
        "If you took Digital Design and Computer Architecture (required course in D-INFK) and liked the Verilog labs, then you will most likely also enjoy this course. Since there is a lot of overlap between this course and the HDL parts of DDCA, you can expect to not have to invest too much additional effort into this course. The projects in the exercise sessions are actually quite a bit smaller than the DDCA ones (so nothing like implementing an ISA or anything), but instead teach a lot more about stuff like verification, good coding practices and other ways of making hardware designs (IP-based design, high-level synthesis)."
    ],
    "Ökonomie": [
        "The course is in german, so I write the review in german: Der Kurs behandelt die Grundlagen der Ökonomie. Für die Studiengänge Umweltnatur-, Lebensmittel- und Agrarwissenschaften ist er im Basisjahr. Das Moodle ist sehr gut strukturiert, mit regelmässigen Quizes, welche einen Bonus an der Prüfung geben.Die Vorlesung wird alle 14 Tagen in mehreren verschiedengrossen Gruppen geführt - ich kann die kleineren Gruppen sehr empfehlen. Es werden die Basics der Volkswirtschaft behandelt.An die Prüfung darf man eine 30-seitige Zusammenfassung mitbringen. (Die Fachschaftsvereine der genannten Studiengänge haben gute Zusammenfassungen auf der Webseite.) Vorausgesetzt man macht unter dem Semester mit, besteht man die Prüfung ohne grossen Lernaufwand.Die 3 Credits sind sehr fair. "
    ],
    "Embedded Systems": [
        "Took it as Elective for CS:Lecture is okayish. Labs are kinda irrelevant for the exam. Exercise session are the type of talking content through and then solving exercises on your own with TAs around if you have questions.Content is somewhat a lot of stuff you learned already from other CS courses + some other stuff and a lot of scheduling.Exam is a bit weird though in the end. You can bring as many written documents (old exams, summaries, etc.) as you want.Grading Scale of HS22:Min points:1.00 : 01.25 : 2.51.50 : 7.51.75 : 122.00 : 2.00 172.25 : 21.52.50 : 26.52.75 : 313.00 : 363.25 : 40.53.50 : 45.53.75 : 504.00 : 554.25 : 604.50 : 65.54.75 : 71.55.00 : 775.25 : 82.55.50 : 885.75 : 946.00 : 99.5Max points: 120HS22"
    ],
    "Probabilistic Artificial Intelligence": [
        "I liked the content a lot, but there might be a little too much of it, meaning you usually don't spend a lot of time on a certain topic. The lecture structure does not really lign up with the exam all that much, the lectures focus a lot on proofing things, but the exam is just \"select the correct answer\". The projects/exercises are very easy to do. Due to the project part being pretty much a free 6, and the exam being single-choice questions, the exam has a high variance, meaning you get punished a lot for a few incorrect answers.",
        "This course covers various probabilistic machine learning models and also has an introduction to reinforcement learning. It's definitely quite feasible and not a lot of effort. But to me it felt like a lot of different things were covered but many things were only touched superficially and there's many similar but different things that one needs to keep track of. While many concepts are definitely interesting, there was just too much jumping around. The course also presents many proofs but often fails to really focus on the importance and meaning of the various statements. So overally, definitely okay to take but don't go in with too high expectations. HS22"
    ],
    "Probabilistic Methods in Combinatorics": [
        "The course content is quite similar to Randomized Algorithms and Probabilistic Methods. In fact, there are some overlaps. However, it's even harder to figure out how to approach an exercise as the whole purpose of this course is to show that things can be proven by essentially proving something else. So the entire course focuses on the \"probabilistic method\" which allows proving (non-probabilistic) statements using probabilistic objects. While some parts are definitely interesting, it's really a theoretical math course so don't expect much in terms of practical relevance. I think the lecturer is really motivated and likes to interact with students. But overall, I didn't really enjoy this course very much.HS22"
    ],
    "Randomized Algorithms and Probabilistic Methods": [
        "tl;dr; many students say this course is the best course of the Theoretical Computer Science major.Content:The majority of the course is spent on probabilistic methods - so on analyzing probabilistic properties. This does include algorithms but also many other things. Random graphs are also a major topic of this part.Another topic of this course is Markov Chains. This might also be the only course where you get a proper introduction to Markov Chains in case you haven't really seen them before. Depending on how far you get, you might also cover Generating functions and some other fancy stuff. Prof. Steger talked about the most interesting stuff after the exam content cutoff so I strongly recommend still visiting those lectures.Some things are extremely interesting and might also be useful in practise. But most tool taught in this course are probably more relevant if you want to go into research in a related area.Prerequisites:This course softly expects that you have some basic understanding of asymptotic analysis, probability theory and randomized algorithms as taught by the bachelor level course \"Algorithms and Probability\" (A&W). It does not depend on \"Algorithms, Probability & Computing\" (APC) at all. The RAPM script is complete and Prof. Steger will not strictly assume that you took A&W so it's also no issue if you haven't seen certain things before.Structure:This course is quite similar to APC in many regards. The homework and the graded assignments are quite similar in terms of structure and difficulty. But as it's only one lecturer and as the topics are a bit more coherent, it's maybe a bit easier to make progress on tasks. Overall:Prof. Steger is one of the best professors of the department so the lectures are extremely enjoyable. Many of the topics may not seem very interesting at first but I still think that this course is quite interesting. The tasks can be quite difficult and the effort can also be a bit unbalanced but if it doesn't clash too much with other courses, that should still work out. Also, we got chocolate at the exam.HS22"
    ],
    "E-Business-Recht": [
        "The lecturer is great and keeps the lecture interesting. The exam was a multiple-choice end-term. If you visit all the lectures you won't have a problem with passing it, if you're not able to visit them they are also being recorded and all the slides are published on moodle. 2-3 afternoons is enough time to go over the material before the exam. Do recommend."
    ],
    "Geschichte II: Global (Anti-Imperialismus und Dekolonisation, 1919-1975)": [
        "The professor is quite entertaining and I really liked the course content.It is not a lot of work and it is very possible to get a good grade."
    ],
    "Geschichte I: Europa (Grossbritannien, Mutterland der Moderne, 1789-1914)": [
        "The professor teaches very good and the course material was very interesting. Its not very time intensive."
    ],
    "Presenting Theoretical Computer Science": [
        "'Standard' seminar course with a 20min./person, technical presentation determining one's grade.The talks are given in groups of two, and an assigned supervisor guides preparation during the semester and such.During presentation they expect you to know your topic well, but otherwise you practically have all the freedom up until your date of presentation.FS23",
        "I have chosen this seminar mainly because of the format, as it does not happen weekly but as a block on two saturdays in April and/or May. Also, the grade only consisting of the presentation and not involving other factors, such as participation or quizzes is a plus.I'd recommend this seminar very much if you want to learn a couple of new algorithms, or also just because of the nice format.To me it seemed that they were rather generous with giving very good grades, but they were brutal to students that did not know their material well by asking questions mid-presentation, e.g. when a property was stated without proof, so be sure to double check everything you say."
    ],
    "From Traffic Modeling to Smart Cities and Digital Democracies": [
        "This is a GESS seminar that covers a very wide range of topics. In the first half of the course, each week there is another guest speaker (often not from ETH) holding a talk about his field of expertise. In the second half of the course, students have to present a paper of their choice in the field of traffic modeling / smart cities / digital democracies. During online lecture times, this course could be very low effort, as there was no attendance required, so you could basically just do a paper presentation (30 - 40 min) for 3 ECTS and not watch any of the guest lectures or student presentations. However, I'd assume that they now require or at least expect attendance.Note that the prof and the COSS team like to ask a lot of questions after your presentation (in case there is time), so maybe think about some possible questions in advance."
    ],
    "Autonomous Mobile Robots": [
        "The main plus-points are the interesting topics and the nice course structure.Very clearly structured lecture videos make for a nice learning experience, allowing for individual learning habits. In the first weeks you look at some physics stuff (kinematics) which can be a bit intimidating. This is only a small part of the lecture though and you will get to the more interesting parts soon enough if you push through."
    ],
    "Interactive Machine Learning: Visualization & Explainability": [
        "good:-you get to work on a project in a team and learn front end webdev-you get to learn about visualizationsbad:-the amount of effort needed if far too high for 5 credits, the project alone feels like it's 5 credits-the exam is basically a voci test where you memorize random definitions that you will never use againyou can search for \"interactive ml\" on quizlet to find flashcards for the exam.",
        "I took this course in 2022 when it was the first iteration.The course is 50% Project and 50% exam.The project is to build an interactive machine learning application in a team of up to three people.You either get to pick to do your own project or you can partner with an organization that has a real world need.Your team is very important.It will reduce your stress a lot if at least one of your team has 1. Webdev experience2. ML experience (application, not just theory)I was fortunate enough to be in a great team and I learned a lot from my team mates.It was a lot more work than expected. And I think the lecturers started to realize this later in the semester and adjusted. They said they'll try to change that and are aware of it having been too much work."
    ],
    "Numerical Methods for Computer Science": [
        "The course discusses extremely interesting topics. I probably learned more here than anywhere else. However that was mostly from self-study and sadly the lecture videos are not very helpful. The script is written well and most exercises are interesting, the solutions tend to be minimal and might not help much. NumCS is a love hat relationship for me as I love the topics but I hate the didactics approach. ",
        "It is necessary to be active throughout the semester and do all the exercises, but it can be quite hard",
        "Interesting topics but very badly presented by the prof"
    ],
    "Geistiges Eigentum: Eine Einführung": [
        "This course covers in 2 hours per week the topics of trademark law, patent law, design law and copyright law with excerpts from the law book and many actual and exciting examples. Furthermore, every week there is a case report to read and a quiz to complete on Moodle, which at the end makes up 50% of the grade. The other 50% is a multiple choice test at the end of the semester. All in all, an exciting course with a moderate time commitment and a sympathetic lecturer. (Experienced in HS22)",
        "Your grade comes from Moodle quizzes and a short exam at the end of the semester and you are judged based on your performance relative to the best score, so you do actually have to get as much of it right as possible or you'll fail. Aside from this it's all good; the lecturer is engaging and knowledgeable and the content is interesting and answers lots of real world questions about what you can and can't do with other people's work."
    ],
    "Software Engineering Seminar": [
        "In the beginning you can choose 5 papers that sound interesting to you. A paper will be assigned to you, which you then have to give a presentation on. There is a big variety among the papers. The main focus seems to lie on programming errors (programmer mistakes, compiler bugs etc...) and how to find and prevent them, but there are also papers about applications of cryptography and papers with focus on machine learning or even some aspects of web design. It takes some time to understand the paper but my TA was really nice and helpful. Most presented papers were pretty interesting and the grading seems generous as well. This is obviously the only seminar I've visited, but from talking with friends this is probably the best seminar in the autumn semester if you're not that interested in machine learning. HS22"
    ],
    "Wireless Networking and Mobile Computing": [
        "Interesting course. In terms of difficulty if you want to get a good grade it might be very hard, but to pass it's 4 free credits as I took it in the 1st semester and spent less than 10 hours in total on it, passed with 4.5HS21",
        "It was very hard for me to determine once the report was good enough to submit. You can always do it more rigorously and detailed. We only got feedback for the first assignment during the semester, so it was hard to know how good you reports were. However I think the lecturer was relatively lenient in the assigned points for the submissions. He's also pretty laid back when it comes to deadlines (I submitted most assignments 1-2 weeks late) because he's also behind his own deadlines.You need to invest quite some time, but I think it's just about fair for 4 ECTS. The assignments aren't \"hard\" per se, but require lots of simulation and visualization. It's also not that hard to get a good grade, and you can assign it to both BSc and MSc which is a plus.If you aren't happy with your grade from the assignments, you can also do an exam about the lecture content. Almost nobody does this though.",
        "In general, this course is quite interesting and gives a good overview of WiFi, Cellular, Bluetooth and some more exotic wireless communication like Visible Light communication. However this course, it is a two edged sword: On the one hand if you're interested in the topic, the lecture can be fun and the lecturer will be available for questions during lectures and per Mail. On the other hand be prepared to spend way too many hours (and/or days) on the assignments which count to the final grade. The credit to work ratio is not balanced in my opinion (the lecturer seems to be aware of it). Although I don't think the content is hard per se, the assignments are sometimes unclear and require own research and guessing what the lecturer expects. The assignments assume that you have (practical) statistic knowledge. Knowing how to interpret, visualize and evaluate statistical data (performance measurements) is not really tought but required in this course. Matlab knowledge is very beneficial.Despite these negative points, a pro is that you will gain practical insights e.g. by working with Arduinos or doing simulations. The later assignments are more practical and more fun.To conclude, I would only recommend this course if you are truly interested and don't mind spending a lot of time on the assignments. If you're only taking it to pass, there are probably other courses needing less effort."
    ],
    "Russisch I A1.1": [
        "A ton of work to keep up but also a great way to learn some basic Russian.Main work lies in revising grammar rules, the alphabet, and basic phrases. You also need to hand in bi-weekly assignments and hold basic conversations during class.The lecturer is really friendly, and passionate about teaching Russian traditions.Overall a fun but tedious course."
    ],
    "Didactic Basics for Student Teaching Assistants @ ETH": [
        "It is mandatory to take some didactic course if you are a TA. However, we started receiving the course content after having taught our first lessons so the timing was horrible. Overall, it would have been way better if this course was done before doing TA and not while doing TA. A lot of the material is extremely boring and not really helpful. Yet, there might be one or two things you can make use of - so try to focus on that. There are a couple of things that you have to hand in. It’s not a lot of effort but you just need to make sure that you do it. This course was carried by D-INFK but I believe the course now is carried by D-GESS with a different course number.HS19"
    ],
    "Introduction to Game Theory": [
        "This block course is just a quick pass through some game theory content. The lecturers are nice, the lectures are decent and following the course easy. There are two major points to consider before taking this course:- It is a block course, so it might overlap with some other lessons. Whether that’s an issue or not depends a bit on the current format.- Writing the mini-thesis about some topic can be quite some effort. You’re free to choose any topic you like but even then it’s quite time consuming. So you might have to invest some time in the off-hours or in the beginning of the semester break.Overall, this course is somewhere between okay and good. There’s no major pain points and the course is generally enjoyable. But it is just a low-credit course so don’t expect some deep insights into Game Theory.FS20"
    ],
    "Pluralist Philosophy of Mathematics": [
        "The course consists of 12 readings with ~20 pages per reading. Each reading comes with a few questions, out of which you can choose one and write a mini-essay answering the question (500-750 words). In total, you have to submit 4-5 mini-essays during the semester, out of which the best 4 will count towards your grade. Moreover, for each reading, you may submit comments/questions about particular parts of the reading, over the website perusall.com. These are not graded, but you have to do this for at least 8 readings, with at least 5 comments per reading. Another requirement to pass the course is that you should \"submit something\", i.e. either a perusall assignment or a mini-essay, in 10 different weeks, to prevent \"speedrunning\". The course covers many different mathematical philosophies, such as realism, naturalism, constructivism, structuralism, formalism, with respect to pluralism. I personally found it more interesting than I thought it would be. The workload is not particularly high, and grading is rather generous. The lectures are devoted to discussions about the readings, and you can use the discussed things in your mini-essays, but it is not necessary to do so (although they encourage people to come to class). ",
        "• Cleanly organised, pretty much all relevant material comes from a single book. Lectures were only mildly helpful.• Workload is very fair and consists of leaving comments/questions on weekly reading assignments and submitting a handful of 1-page essays. The text excerpts can occasionally get a little hard to understand but having an interest in thinking about the nature of math (e.g. \"math is invented vs. math is discovered\") makes it more enjoyable.• Essay grading was quite generous.Good math philosophy course overall."
    ],
    "Algorithms, Probability, and Computing": [
        "APC is an extremely interesting course that builds on top of A&D and A&W (and maybe also LinAlg, DiskMat and PProg). The course is purely theoretical and you will not have to implement anything. Compared to A&D and A&W it is significantly harder. Doing this course together with a smallish and active study group would help a lot. APC consists of six disjoint chapters which means that there are “backup topics” if you’re completely lost in one of them. There are two sets of graded homework - expect to spend a lot of time on solving them and writing them down. Unlike with A&D and A&W, solving APC tasks is extremely hard meaning that you often understand what the task wants but you cannot find any attack vector to make any progress. This is extremely frustrating and together with the very theoretical topics, this can be very straining. Doing APC is recommended if you want to write a thesis in the theoretical CS section (complexity theory, algorithms etc.) or if you want to continue your master in that direction. I think it’s very hard to give a simple, summarising judgement for this course; it is very interesting but it also is very hard. So: Go into the course too fast, the course eats you!HS20"
    ],
    "Computer Systems": [
        "It feels like a cross over of PPROG, DMBD and SPCA. There is a decent bit of overlap with these courses but also a lot of new topics. It is split into two parts, computer systems and distributed systems. Where distributed systems has a decent chunk of crypto currency and the technologies behind it. While this probably would deter a few people, it is actually rather interesting.You can improve your grade with an optional project, which I myself have not done, but I hear that its most likely not worth the effort. You only get all the bonus or nothing. While they eventually provided tests it was still uncertain if they cover all edge cases. I guess we will see after prüfungseinsicht how much the tests helped.HS22",
        "This course covers a large number of quite unrelated topics including such as Operating Systems, Game Theory, Block Chain, GPS and more. On the one hand, there’s a decent chance that you find some topics interesting. On the other hand, you might also dislike many of them. I personally felt like the first part contained virtually no tangible content. The second part did cover many interesting topics and while they do technically have some common theme, the second part does feel somewhat chaotic. The parts that are covered a bit more in-depth are hard to follow because the various problems and solutions often only differ little and thus it’s easy to confuse things. And other parts are just about completely different dimensions of a related topic which sometimes just feels weird.The exercises are unfortunately mostly pointless. And fortunately, this course doesn’t have any prerequisites. But overall, I can recommend following the lectures in the semester and then just preparing for the exam. HS20"
    ],
    "Compiler Design": [
        "Didn't expect to ever take thsi subject but since it has a very high passing rate I ended up takign it and enjoyed it. You get to do a lot of programming in the projects and the content is surprisingly interesting and not very math heavy. It's very nice to have 50% of the grade in beforehand but it is a lot of effort to get the projects done.",
        "The course wants to take a lot of your attention, especially with the projects. The good thing is, if you do put a lot of effort into the projects, you learn an immense amount and the projects and lectures synergize quite well (thought frustratingly the lectures are always far ahead of the projects).Professor was very nice and seemed to geniuenly care about the students, sadly the actual excitement in the lectures was quite low for me. The content gets interesting after finally understanding it.",
        "Very interesting course and teaches you a lot of how compilers work. 50% of your grade is based on bi-weekly projects in OCaml that take quite a bit of work, but not so much that I'd consider it *too* much. Many of the lectures towards the end are usually not exam relevant, so after you're done with the projects you can enjoy some neat tidbits from the world of compilers. Would recommend for anyone interested in compilers or coding in general, with the caveat of being aware that it'll be quite a bit of work during the semester (in exchange for an easier Lernphase)",
        "Overall this course is not too interesting and it does require some effort but quite enjoyable anyway. The lectures aren’t particularly interesting - the course is mostly just working through the various layers of a compiler. For most parts of the content, it’s really just a “working through” the steps as most steps follow quite directly without any special insight or tricks. The more interesting topics such as parsing and optimization make out only a small part of the course. But following the lectures/exercises does not require any extra effort.The only extra effort required is to be spent on the six projects. They take increasingly more time. The first one might take an hour or two. The later ones might also require more; though, likely somewhere between 5 and 20. The projects are coding projects in OCaml. The biggest hurdle to OCaml is setting up the environment - after that, your Haskell experiences should cover for the rest. OCaml is even more flexible than Haskell so you technically have more freedom if you’re not a friend of the pure functional programming style of Haskell. Another challenge is often understanding the code template you get. Other than that, the projects technically wouldn't be that hard.Having done FMFP definitely helps as many relevant concepts are also part of FMFP, inference trees also show up and having a fundamental understanding of functional programming will help with solving the projects.As the project counts for 50% of the grade (and is basically always more or less a 6) and as the exams aren’t too hard either, most people get very good grades in this course. And in fact, it has a 100% passing rate almost every year. HS20"
    ],
    "Grundprobleme der Wirtschaftsethik": [
        "Quite interesting topics (this year focusing on the problems and injustice of wealth), also not missing out classics like the tragedy of the commons. Though the prof talked a lot during the discussions he invited, making them somewhat onesided. (Until you got to talk the discussion likely moved to the next point)2022 it was recorded, also quite cheap credits (~7 pages of philosophical discussion with the deadline being whenever you need the credits)"
    ],
    "Natural Language Processing": [
        "I found the course interesting. Beware that it focuses far more on the algorithmic and ring theory parts of NLP instead of the LLM and general ML aspects of it. The material is presented in a clear and interesting way. The TAs were as well very helpful. The additional script was useful.However, I would only recommend the course to people who have a strong interest in NLP. Otherwise, the coursework is too much work for 7 credits.  Some assignments had tasks which were badly phrased/confusing and it was sometimes hard to tell if a particular task is badly phrased or if it simply required more work.A large part of the exam is the exact same word-for-word as tasks from the assignments. The lecturer justified the assignments as being so demanding with that. That is a double-edged sword because of the grading-on-a-curve policy: On the one hand, if you put in the work you are guaranteed to get a decent mark. On the other hand, most other people will know how to answer the assignment questions just as well, which makes it harder to get a high mark.",
        "The Course Contents are very interesting, the script is great and this semester the TA's I interacted with were very motivated.However it feels not very planned out especially in the design of the exercises. They are published early and way too much work. Each takes in my experience about as much as all exercises of AML or PAI combined. A small subtask of Task 2 is a full project in ASL. If you start early you risk doing too much, as in some tasks they were later changed to be made easier. But you can not really do that because it is graded and you could end up starting too late.All in all if you want to learn NLP, really really bad and having nothing else to do the whole semester then I'd recommend it. Otherwise, use the publicly available script and other courses to study it.The exercises are tedious, not difficult, thus IMHO they do not create so much extra value in understanding that it is justified spending that much time on a 7 credit course.",
        "This course is so bad, that out of the 400+ people who signed up only 90 were left by mid december. The course website is public, so you have a look at the assignments for yourself."
    ],
    "Biomechatronics": [
        "Lectures and exercise sessions were a bit random, so in the middle of the semester I stopped visiting them. I actually only learned for 2 days for this subject and passed, so if you wanna easy credits, it may be something for you. But they change the exam every year a bit and there is no old exams, so idk how it will be next year. There is a very good summary though, just ask on discord. The exam was on Moodle and there was no exam review. For the exam you need to learn stuff by heart and be able to do simple eigenvectors math. To conclude, it's not a bad course, but I didn't find it interesting or useful besides giving credits. "
    ],
    "Complex Social Systems: Modeling Agents, Learning, and Games": [
        "at the beginning at the course I thought wtf should I drop? I think someone who also tried this course dropped after the first lecture. The material seemed too hard and wasn’t really explained. Only after some time I realised that I don’t have to understand this, I just have to get my project done and saw lectures as cool complicated thing without trying to understand it. About the project: you have to make a group with up to 5 people (iirc) and then choose a topic and a tool. For example, my team chose pandemic as topic and reinforcement learning as tool. So we had to do an RL model about pandemics and then write a report about it and do a 15min presentation. All lectures are split into several parts, so lectures on RL were in November, so I just skipped a bunch of lectures and then only watched those which were related to our project. I got into a really good team, where all people were master students in Bio engineering. BTW a majority of people who was taking this course was either master or phd students. Only some Bachelors were there, so I cannot recommend this course for you if you want to take an easy course. Profs were ok but I’ve seen better ones. The TA is absolute legend and helped a lot with the project. Although there is no exercises or exercise sessions, you only get one lecture per week which were completely online due corona, but the videos aren’t available anymore, because they were on YouTube and now they are private"
    ],
    "AI4Good": [
        "Really interesting and fun course, there are also guest lectures on writing academic papers and scientific English. There might be a bit too much work for a 3-credit GESS course, but you will definitely gain some useful experience there. Though the course might be a bit too hard for entry ML level, as you need to use some advanced methods to deal with tough data or try to outperform baseline results (depends on project).HS22",
        "A hackathon.You work on real life machine learning problems. Among them Deforestation, Mapping via Sattelite Images and identifying rare species of animals.It's a lot of work (for a 3 credit gess) but you learn a lot.I would suggest signing up with a friend or two, because you are going to be relying on your teammates to pull their own weight."
    ],
    "Algorithmen und Programmieren für die Chemie": [
        "High quality course that is well tuned to the Chemistry program. I felt the coding in the exercises was very helpful in understanding the content though the exercises are not extremely difficult in my experience. For people with 0 background in object-oriented programming they might prove more challenging though. The content is very interesting and strikes a good balance between chemistry-specific and general concepts IMO. You should have a nag for a theoretical treatment of algorithms to enjoy however. Some of the exercises felt a bit sloppy, but the TAs were quite helpful and the fact that you get two exercise sessions per exercise is really helpful in my experience. The lecturers do a good job and I would recommend the course. ",
        "The course allows for combining programming with chemistry and learning about many very important approaches in future computational chemistry; the exercises aren’t easy but they really help to get first hands-on what is covered in the lecture; especially when one gets through the first half of the course, everything is put together and you start seeing the importance of what we are learning here",
        "The course can be a lot of work on the coding exercises (non obligatory) but they help a lot to understand the subjects covered. The oral exam is easy if you do the exercises and study a little. I can recommend this to anyone who enjoys coding and informatics."
    ],
    "Immunology I": [
        "The content of this lecture covers all important basics of immunology and can be a bit boring at times, but it is a good starting point if you are interested in it. The second part is more interesting."
    ],
    "Sustainable Development - Bridging Art and Science": [
        "This course attempts to shed light on the Sustainable Development Goals established by the UN, by watching five movies, each focusing on one of the pillars of Sustainability (Peace, People, Prosperity, Planet, Partnerships). The students gather in groups and make a movie of their own, showcasing a topic portraying one of these pillars. At the end of the course, each student also has to write a reflection essay on one of the movies watched in class. The course seemed to be slightly unorganised though, and there were several technical issues throughout the semester."
    ],
    "Medieval and Early Modern Science and Philosophy": [
        "Very interesting course tackling the history and philosophy of scientific research, focussing mostly on Mathematics and Astronomy, and also the societal response to some of the major discoveries in the medieval and early modern times. Three comments (ungraded) are to be written during the semester, and a final essay determines the grade."
    ],
    "Analytische Chemie II": [
        "Continuation of trace element analytical chemistry taught in Analytische Chemie I, and also of more complex NMR spectra of organic compounds. In addition, separation methods are introduced, the lecture being more focused on Chromatography. The course unit Spectra Interpretation of Organic Compounds (Instrumentalanalyse Organischer Verbindungen) is very recommended, and plays the role of a typical exercise class."
    ],
    "Analytische Chemie I": [
        "Lecture is split into two parts: spectra interpretation of organic compounds, where you learn how to determine a molecular structure from mass spectra, IR spectra, and NMR spectra; and trace element analytical chemistry (Elementanalytik), more oriented towards inorganic chemistry. The part on spectra interpretation is not only very important, but also quite amusing, since in the exercises, you have to pretty much play the role of a detective, finding clues in the spectra to determine the compound. I found the other part on trace element analytical chemistry not as interesting, though the methods also being very important to learn."
    ],
    "Astrophysics I": [
        "Very extensive introduction in the many branches of Astrophysics, touching on Stellar, Planetary, and Galactic Astrophysics, as well as some Cosmology, which can quickly become quite complicated. Still overall a very interesting lecture, especially since it merges many fields of Physics that are necessary to fully understand the concepts, like Classical and Quantum Mechanics, Particle Physics, Thermodynamics and Fluid Dynamics, etc."
    ],
    "Physical Chemistry V: Spectroscopy": [
        "Contains quite some repetition from Physical Chemistry III. The lectures might not be the most captivating, but the knowledge gained in the physical background behind optical spectroscopy is nevertheless important, since it's such a fundamental method in natural sciences."
    ],
    "Physikalische Chemie IV: Magnetische Resonanz": [
        "Did not find the lecture particularly interesting or useful, unless you really want to go into NMR/EPR-specific research, like method development. In my opinion, there are many gaps when it comes to the physical background of several concepts, making them difficult to understand."
    ],
    "Microbiology (Part II)": [
        "This second part focuses on microbial metabolism and interactions, with other microbes, or with hosts, including understanding on both animal and plant microbiota. I found this lecture really interesting, especially since it also touches on other topics in Biology, such as Immunology. Again, memorisation of specific details is required to obtain a good grade, including a broad knowledge of several bacterial species mentioned throughout the course."
    ],
    "Microbiology (Part I)": [
        "This first part is more focused on bacterial cell structure and genetics. Though interesting, quite some memorisation is required for a good grade, including of more specific details mentioned in the lectures."
    ],
    "Medizinische Chemie I": [
        "Very interesting course, the important concepts are repeated and not much chemical knowledge needed. Prof. Hall gives an interesting insight, in how drug development and pharmaceutical companies work. "
    ],
    "Information Security": [
        "Very challenging, but if you are interested in anything in this direction, very rewarding. The resources given are very good meaning that the make or break for this subject tends to be if you're able to power through the exhausting exercises.FS23",
        "Information Security is definitely one of the more challenging Kernfächer. The exercises can take a lot of time to solve especially during the first part. The lectures are great and you can learn many new concepts. When I took the course there were four different lecturers and not all of them were equally good at lecturing.The exam was very difficult and there wasn't enough time to solve everything but the grading wasn't too harsh."
    ],
    "Visualization, Simulation and Interaction - Virtual Reality I": [
        "The lecture style is quite different compared to most ETH courses, with a focus on practical examples and mostly explaining concepts without going into detail or caring much about the math involved. For me this was a welcome change compared to my other courses. There is some content overlap with the visual computing core subject. The project is a really cool opportunity to work on a VR project of your choice, sadly there was no detailed feedback to it. All in all I'd recommend the course very much if you are into the field of VR or visual computing in general. The minimal effort required (so without optional project) is pretty low, as the exam just required you to memorize a couple of concepts.",
        "I can recommend it. The organisation feels a little bit lost imo (stuff like lets do a doodle to find an exam date). The content is kind of interesting, nothing too special. Its nicely explained, making use of some fun ressources but there was a lot of repeating stuff. The exam isnt too hard, gave gymi exam vibes but looking over the whole material before the exam is needed.The project was really fun to do but here comes the part that bothered me the most. A lot of students spent a shitton of time on some really cool projects and they never aknowledge them once you submit. You probably get the bonus but you wont know how much. They wont give you feedback and there was no option to try out the other students games or even see what they ended up with :((( (Edit: I asked the Prof about it and the TAs should have uploaded the projects to moodle for everyone to try but they just didnt do it.)"
    ],
    "Parallele Programmierung": [
        "Course and topic are very interesting. However, the course itself is not structured well at all: the lecture itself is quite messy and often a bit boring. The exercise lessons were only partially helpful, it felt like the TAs were not prepared enough for the job. Also, some definitions changed mid-course, which does not bode well for the already unclear course. There also is no official script.However, the exam is not too hard and helps a bit to boost your average. The PVW script and course are (in my opinion) way more useful than the lectures themselves.FS23",
        "Generally I think it's an interesting course, but there is also a lot of repetition during the lectures which can be a good or a bad thing. The exam is very consistent over the years, so you can prepare for it well by solving old exams. Unfortunately there are many mistakes in the exams and some definitions are not very clearly defined, so it can lead to a lot of discussions (you will notice it when looking at the answers on exams.vis).FS23",
        "This course has the potential to be interesting but is mostly a mess. Some things and statements are not clearly defined or they take assumptions when proving statements without explicitly stating them. This can lead to you discussing with your colleagues for hours on end about what is or isn't starvation-free, wait-free, etc.But at one point you just have to learn to not question everything that's presented to you and solve the old exams, which prepare you very well for your actual exam. FS22"
    ],
    "Analysis I": [
        "Depending on how much Analysis you had in high school this course might not require a lot of effort. However solving the exercise sheets and attend the exercise sessions is important if you want a good grade.",
        "This is a very thorough course on your high school mathematics that goes much further than that. It might not be to everyone's liking but it gives you a solid foundation for your further studies. Make sure you have a good TA and understand all the concepts enough to prove medium to easy statements with them. (Reaally make sure you understand how the Taylor Series works. It's beautiful;)FS22"
    ],
    "Digital Design and Computer Architecture": [
        "Course is quite alright, good introduction into basic topics. However, the lecture is more or less a powerpoint presentation with hundreds of slides, which makes it hard to understand what is important. The labs are a bit messy too, and you are not really prepared for them at all. The course, labs and the exam are only sharing the same general topic, the exact details are extremely different for all of them.The lecture does not prepare you for the exam at all. Thankfully, it is not hard to pass (80% pass, quoted from the prof) and the same type of questions are in it every year. Just prepare with the old exams and the Optional Homework, and you will likely have a good grade.FS23",
        "Lectures are very unorganised, the lecturer jumps from subject to subject. The slides are overloaded with information, it makes it hard to follow.The lecture is also not directly relevant to the exam. The optional homework is the only important part.On the positive side, the labs were really interesting. It’s breath of fresh air compared to the usual Basisjahr subjects. Unfortunately, this is a class which required an exercise session, which it did not have (replaced by labs). FS23",
        "I found some of the lectures incredibly interesting, while in other lectures I felt completely lost and didn't really understand what was being explained. This doesn't matter too much because the labs, exam and lectures are quite disconnected from each other. You can successfully solve the exam and do the labs without the lecture, some would say not watching the lectures is probably more time efficient. What helped me the most to learn the theory is the Harris & Harris book that is suggested by Prof. Mutlu and the PVW to be able to solve the exercises quickly.The lab that gives 30% of the grade is very doable and if you put enough time into it, I think it is possible to get (near) full grade, which is a big boost for the end grade.For the exam you just need to solve the optional homeworks, which can be very hard to solve at the beginning, since the lecture doesn't prepare you too well for them. However, the exam questions are usually very similar to the optional homeworks, meaning once you can solve them you are well prepared. You just need to solve as many exercises as possible during the exam, the time is very limited.FS23",
        "The lecture can be very fast and difficult to understand because Prof. Mutlu goes off like a rocket sometimes.But on the other hand the exam is easy to prepare for(even though time-intensive). As you'll hear from every corner, do the optional homeworks and you'll quickly recognise the different types of exercises. Then just make sure that you've got a recipe for each type and you're good to go. You then just have to be quick in the exam;)FS22"
    ],
    "Analysis II": [
        "Very similar to Analysis I, but with a lot less proofs.",
        "A mechanical course about multivariate calculus and ODEs. The content is not much but there is a lot of integration and calculation in general required of you"
    ],
    "Computer Networks": [
        "CN was very interesting for me and feels important for \"work\" later on. The lectures are fine, but unfortunately weren't well visited. For me, the content wasn't too difficult, but you need to suck in a lot of detailled knowledge in this subject. Reading the book is probably not needed, but still good if you want to know more. You \"pay\" a lot of time for the projects, if you do them. The exam feels \"brutal\" time wise, and it feels as if it's getting worse, even if the questions aren't hard. Better choose the questions you answer wisely.I heared that people use Anki cards for this subject, but I'm not sure if they really help in the newer types of the exam, as they seem to shift to more calculations and less MC.FS23",
        "Interesting course in general, but can be a bit monotonous.The exercises and the exams are sometimes rather theoretical.FS23",
        "Can be a lot of content to take in, is a bit of a learning by heart course."
    ],
    "Data Modelling and Databases": [
        "The topic itself is quite interesting, but I don't really like how it was taught. Things are often taught in a very superficial, non-applicable way, e.g. it just becomes about learning and memorizing recoverability classes instead of actually applying them.The exam felt more like an IQ test than anything else.Does not require a lot of effort.FS23",
        "Little content for the amount of credits. The exercise types are similar between exams, so if you know them you should be fine."
    ],
    "Formal Methods and Functional Programming": [
        "The course focuses on introducing Haskell (functional programming), and then proof techniques (formal methods) relating to programs, sprinkling in some induction (proofs) all over the place.Solving the series can be time intensive but directly prepares for the exam (as there are precise and predictable programming/proof patterns to 'train').The midterms were a bit stressful, but kept me up-to-date.(On a personal note, I found the weekly Haskell tasks very fun to solve)In the end you should make sure to be relatively quick in the induction proofs to get enough points in the exam, otherwise all-in-all a demanding but doable courseFS23",
        "I liked the course, especially the first part (functional programming), Haskell helped me understand the recursion better. FM part was very theoretical, but it was interesting too, although at some point it felt like discmath. ",
        "I feel like this is a course where attendees either love it or despise it. Understandable to some degree, the course carries with it a whiff of unparalleled formalism where you have to be very precise about otherwise trivial things. However it all comes together beautifully and hopefully you can appreciate the beauty in making provably correct code. Haskell is a handful as well. The course also has two 30 minute midterms"
    ],
    "Systems Programming and Computer Architecture": [
        "Beware that i am in the minority when saying this, but: i found the projects (labs) during the semester to be quite awesome. They are practical, teach you real C coding, assembly and GDB debugging skills which you don't quite get from the lecture otherwise. That being said, they are time-intensive and if you're only after a sufficient grade, there are more grade-efficient ways to spend your time. However i'd say they are fun so if you're ambitious and wanna learn, try them :). The lectures are quite nice to listen to as well. There is quite a lot of content coming your way in the end."
    ],
    "Theoretische Informatik": [
        "Nice course to get an introduction into the nitty gritty of theoretical computer science. P vs NP, Turing Machines, formal Computer Science lingo - this course has it all. The course offers two midterms, the two of which can optionally completely replace the final exam, if the grade is sufficient. This can be quite nice to take some load off of Lernphase. You'll have a lot of proofs and formalism in this course, which may to be to your dismay, yet you will have to go through that and it's actually not that tough as you may think :)."
    ],
    "Wahrscheinlichkeit und Statistik": [
        "Prof. Tassion was quite engaging to listen to. A lot of basics will be taught in this course, so if you were not well off in AnW this is a chance to learn probability and statistics anew. The content is kept reasonable for a 5 ects course imo and there are not any particularly difficult topics that stand out. There is a lot of integration and calculation though, which might prove to be a pain depending on your affinities. In FS22 the exam was pleasant but the grading was rather harsh to make up for it. "
    ],
    "Human Computer Interaction": [
        "The course is not too hard and doesn't require a lot of effort. However this course is very unlike the other ones at ETH and requires a lot of 'soft work' such as doing interviews and writing painful document, summaries and formatting. This is much more like FH courses than a normal ETH course. So if you're going for an a course that is doable easily, you're in luck. But if you're actually looking for an intersting/challenging course, this is definitely not for you. ",
        "ETH’s HCI course is not a “build pretty frontends” seminar but instead an in-depth look at the fundamentals (Human-Centered Design cycle, Device Taxonomies, Model Human Processor, …) of the discipline AND at the cutting-edge of computational interactions and closed-loop systems. Even well-seasoned UX enthusiasts will find something new or interesting in it. (I’d like to highlight that this course does NOT compare to the HCI Cognition GESS course!)The project(s) are probably the most hands-on you’ll go during your studies (when it comes to app development) and (at least in HS22) pretty open-ended. If you have some burning app idea but no idea where to start, this might be a great place to do so in a collaborative, well-structured manner.HCI is definitely one of my favorite undergraduate courses!HS22",
        "THIS COURSE IS NOW A CORE SUBJECT (8KP).This means content will be added and the project likely expanded a bit.Your grade will be based on a project that has to be completed before christmas and an end of semester exam (!).The project can be tedious at times, going through all the different protoyping stages and such, but it offers a nice view into actual, more practical work which is rare at ETH.The exam is pretty doable. Its mostly about remembering facts and definitions from the lecture (including quotes) and what to use for certain tasks.Note that in HS22 there were also some calculation questions which were not part of the mock exam. The mock exam is also your only point of reference for what the exam is going to look like.HS22",
        "If you don't have frontend experience, be prepared to learn it or don't take the course. Half of the course is a project that focuses a lot on building good UI/UX and there's quite some polishing and developing involved to get to a smooth product. The project is done in groups, so if you already have a pre-made group (5-6 people usually) that is advantageous (else you're probably just gonna end up in a random group which is also fine of course). The lectures i visited were quite interactive. The exam was rather predictable and is learning by heart."
    ],
    "Erdwissenschaftliche Datenanalyse und Visualisierung mit Matlab": [
        "As of Fall 2022 it sadly isn't available anymore for INFK. Needless to say it wasn't demanding at all given some programming experience"
    ],
    "Die Rolle von Technologie in nationaler und internationaler Sicherheitspolitik": [
        "This is a MILAK course, so there are mostly members of the military in the classroom which gives it a different kind of vibe.Unfortunately due to Covid, in HS21 there was only one guest lecturer: Stefan Mogl, the Deputy Director of Labor Spiez. This was the highlight of the course as he could give insight to how this Laboratory works and how political it can be. He also showed pictures of his mission in Syria investigating poison gas attacks.Otherwise the lectures felt a bit incoherent and boring at times. This was mostly due to having lots of different lecturers.The exam was a 1.5h or 2h written exam with 6-8 questions which had to be answered with prose. It was a fair exam and if you're at least somewhat interested in international politics and read up on the news and can connect that knowledge with concepts introduced in lecture, you'll do fine in the exams. And don't feel intimidated by all the military students!"
    ],
    "Information Retrieval": [
        "I took this course in FS2023 held by Dr. Ghishlain Fourny. The lecturer is great, you can check out his youtube channel where he uploads all his lectures to get a first impression. The recordings are even marked by chapters. If you don't like watching lectures you can also just read a book instead. Doing either should suffice to pass after doing a few practice exams. The book is available for free as a pdf to ETH students. The content is easy to understand and the exams are rather straightforward for ETH standards. Generally speaking, I can recommend the course if you're somewhat interested in the material. But I feel like the course is a bit overhyped. Yes, it's a solid course but I personally wouldn't recommend choosing it over another course you are more interested in or is more relevant to the direction you might want to go into. In hindsight, I slightly regret taking this course over other courses I would've been more interested in. However, if you just want credits, or you want to learn about the topics covered in this course, it's definitely a great choice.",
        "I'm in the minority to say this but I didn't find the lecture to be particularly interesting. The material is presented more on the level of \"this is the idea\" without going into great detail and with a lot of simplifications. Some things that (to me atleast) seem very simple are explained 2-3 times which causes me to divert my attention during the lecture (even though I agree with others that Fourny is a very good speaker) and lose focus when then a more challenging topic is covered. I haven't done the exam yet but from the exercises and looking at a few old test questions it seems to be more about having memorized certain facts and computation, which I don't like so much.FS23",
        "Best Prof EU West. Best Course. Very interesting. Can only recommend not much else to say. If you need 4 ECTS in Electives category this is the course to go.",
        "This course is essentially an introduction to building a search engine that can find relevant words or subwords in an unstructured text - all without ML even though it could be plugged in at various stages. Fourny is one of the best lecturers of the department (and maybe he will eventually get the Prof title he deserves) so the lectures are well-structured, easy to follow and overall enjoyable. The course content is also interesting and might be a good taster if you’re considering going into the data management systems direction later on. The exercises are a mix of programming (Python) and theory. They aren’t that hard but calculating things is the central topic in both the exercises and the exam. That’s maybe not ideal but passing the exam is very feasible as well. This course doesn’t really have any prerequisites. It might help if you know the basics of Python. It’s a course that could also be taken early on in the bachelor's. Overall, I can definitely strongly recommend this course to everybody.FS21",
        "I took this course in FS21 so the format of the lecture was a bit weird at the beginning of the semester, the lecture was held on zoom and livestreamed to the lecture hall, where a TA was present to answer questions. The content is interesting. It would probably be possible to pass the course without going to the lectures and only reading the book, however I think it's worth attending the lecture because prof Fourny puts a lot of effort into making the lecture interactive.The exercises aren't really necessary to pass the exam, but they are worth solving if you want to apply the concepts learned. The exam isn't too difficult, but time might be an issue.FS22",
        "Great lecture and great lecturer. The programming exercises are really interesting. The exam isn't really difficult but it feels more like they're testing your arithmetic skills than how well you understand the content. Overall one of the most enjoyable lectures I had so far.FS22"
    ],
    "Datacenter Network Monitoring and Management": [
        "Interesting seminar and very easy to passThe workload is also very minimal compared to other seminars. 11/10 would recommend"
    ],
    "International Environmental Politics": [
        "Easy course but all in all very dry. Professor loves to repeat himself and get's a bit lost in certain topics",
        "very good effort/grade ratio and gives 3 gess credits, can't complain"
    ],
    "Introduction to Machine Learning": [
        "Projects were the highlight and very interesting, lectures were fine. The subject matter by itself is very cool but it requires you to be very comfortable in linear algebra, higher level differentiation and probabilities.FS23",
        "This course serves as an introduction to (the theory behind) machine learning. As machine learning is a big part of modern CS, this course is extremely relevant for most students. Furthermore, many theses include ML in one way or another so it’s not uncommon to do IML in the 4th semester or the thesis in the 7th semester. Though, IML can also be done in parallel to a ML thesis.IML itself builds on multivariate analysis and probability theory. Many students have never learnt how to get multivariate gradients and derivatives in practise but you can easily learn that by yourself or by asking someone who knows one of the four methods. Many students don’t even care about it and pass IML without ever learning it but I highly recommend exploring this before or during the course.The course itself is somewhat controversial. Some people love it, some don’t like it. I think that it’s a decent introduction to ML but it mostly focuses on the theoretical foundations so if you want to use it practically, you have to put some work into it yourself (and I would recommend doing so). And this is also reflected in the projects. You are relatively free to use whatever you want but they (and I) highly recommend using Python, Sklearn and Pytorch (TensorFlow, Keras etc. definitely work too). I personally did the project without almost no prior Python experience and without having used any of those libraries before. The projects vary a bit over the years and the difficulty and effort required is also quite different from project to project. The time required to do a project can be anywhere in the single or double digit hours - if you’re used to this kind of trial & error programming and have a good idea where the issues are and have ideas how to address them, you can be extremely fast with solving the projects. If this is not the case, you might lose a lot of time. In fact, if your skills are somewhat limited, you may also lose a lot of time by exploring suboptimal approaches or bad hyperparameters with extremely bad performance - so it takes a couple of hours to see that your program is not good enough. In other words, the projects be done quickly but they can also be extremely time-consuming and as they are quite unguided, it might be hard to make progress without any help. I personally solved them all on my own without asking for help, using task-specific tutorials or anything. The exercise sessions do give some basic introduction to Python and PyTorch. Otherwise, they are mostly like lectures that introduce more content.Most people tend to get good project grades and as the exam is multiple choice, the course is relatively easy to pass. Though, make sure that you understand how their exam papers work.FS21",
        "The lectures were very theoretical and focused a lot on the mathematical aspects of machine learning. I don't think this is a good way to introduce the topics, some more practical knowledge and examples would have been great.The projects are the practical part of the course. They can be a fun and interesting learning opportunity. They often aren't related to what is currently taught in the lectures. The projects can be very challenging and time consuming, even more so when you have little or no experience with machine learning and python. I would recommend solving them in groups.The exam is multiple choice and rather easy compared to the projects.FS22",
        "This course is probably the most interesting course in the whole BSC. You will gain a pretty good mathematical overview over the whole ML topic. However we didn't learn anything about reinforcement learning sadly.The homework tasks and exams are quite hard in the beginning. Even more so since the tasks have mistakes in them (most of the time). But with some practice the exam is quite doable. Additionally you have to keep in mind that you will get 30% of your grade from the projects.The projects are very fun. Sadly the lecture doesn't really focus on how to do them so you are on your own for the most part. There were two baselines - one for public and one for private - against which your submitted predictions were tested. To get all the points you have to be better than both baselines. Most of the time this is very easily doable. Project 3 had pretty hard baselines imo tho. Depending on your knowledge on the matter the projects can take anywhere from 1h to like 2 days. Additionally it can be a pain to train if you dont have a gpu. (you essentially have to do it online..)All in all I would highly recommend the course. ",
        "The lecture was quite mathematical at times, which is not inherently bad, but sadly it often came in place of teaching practical and intuitive knowledge that would have helped with the projects. The projects are fun and interesting, though they can be demanding, especially without prior python/ml knowledge.",
        "For a course that is called introduction to machine learning, it focuses very little on introduction parts. Most of the topics cover the mathematical aspects of machine learning, which are obviously not irrelevant but at times feel like they should not be in the scope of an introductory course.You hardly get anything tought about the practical aspects, as in implementing and setting up a machine learing model for the graded projects.Here you are mostly on your own (or as your group) and have to figure stuff out by yourself. This can at times be really frustrating and time consuming as it often comes down to trial and error which based on your approach can take a long time to go through all the steps.There were a few tutorial sessions where they gave us a brief overview of functions and how to use them, which was nice, however it was rather late in the course and only after people were struggling with a previous project.FS22"
    ],
    "A Sampler of Histories and Philosophies of Mathematics": [
        "The course certainly delves more into the philosophical aspect more than it does about simply reading what kinds of mathematics were practiced during given historical periods - rather, it analyzes \"why\" and \"how\" mathematics were practiced in historical societies.The work may seem daunting but is certainly interesting and allows one to view mathematics through a more \"Geisteswissenschafts\" lens. It is rather heavy on reading, reading comprehension, and (partially philosophical) essay writing, where it is crucial to have understood the texts and know the context(s) of the weekly topics in order to get a decent grade. Arguably the course is best suited for people who have one foot in mathematics or similar \"abstract\" hard sciences and the other in more social studies.FS23",
        "*This course is a twin (i.e. same professor, structure, grading; similar content) to the course 851-0184-00L Pluralist Philosophy of Mathematics.Minor differences:- Readings were a varied selection of philosophical mathematics texts (instead of from a single author).- Grading felt slightly less generous.It was an okay course.The readings were at times hard to really 'get'.The fact that grading was purely distributed throughout the semester made it chill to take.FS23",
        "This course requires more time and effort than other GESS courses e.g. Network Analysis. Nonetheless I would recommend it if you like writing essays and/or philosophy.HS21",
        "I quite enjoyed the course. One had to periodically read famous mathematical texts from different periods of history. The philosophical aspect was rather shallow though. Among all those texts, one needs to choose a few of them to write essays on. A choice of essay topics for every text is provided. In their grading they really value completeness, so beware of that when writing your essays, they are looking for summary-esque texts over creative interpretations. If you want very low effort and/or don't like writing essays, this is probably not quite the course for you.",
        "Many interesting things covered, but overall the course is more on the \"histories\" rather than on the \"philosophies\" side (which is not really what I expected or signed up for)."
    ],
    "Big Data": [
        "The course was very well structured. The material was presented in a clear way. The script provided the right additional level of depth. The quizzes prepare you fairly well for what to expect on the exam.",
        "Overall this course was good, but it is a 10-credit course; as such, it needs a lot of time during the semester. Furthermore, the exam is stressful because of time reasons, but the grading is fair and assumes that we can solve not all questions in the available time. In HS20, ~70% of the points got you the 6.One little advice regarding the exam (as long as they are doing it the same way as in HS20): They are only interested in the result, and it is possible to solve all the questions without using the \"Big Data tools\" learned in the lectures. That means a solid understanding of python and pandas was enough to solve all programming exercises in HS20. "
    ],
    "Advanced Seminar on Computational Haptics": [
        "This seminar is very enjoyable! The discussion part after the presentations is not used to ask hard questions to the presenters. Instead, the whole group discussed how we could improve the presented paper. The grading is very kind; I feel like you will already get a 5 for just showing up. "
    ],
    "Umwelt-Management": [
        "Very easy GESS course! Everything is online, and the grading is based on 5-8 slides done in groups of 10-15 students. Everyone that I knew got a 5.5 or a 6."
    ],
    "Algorithmen und Datenstrukturen": [
        "In general, super interesting! This is a great base for future courses. The profs do tend to make the explanation more confusing than it needs to be, and some lectures are confusing you more than teaching you new things. The script is quite nice, but more extensive than the infos from the lecture itself. The (coding) exercises are only partially doable from the course, and need a lot of time / prior knowledge (or google) to perfectly finish.Overall very good, but since it's a Basisprüfung-Course, there is not really a decision to be made.HS22",
        "Loved the lectures - very interesting and well-presented. There are a lot of exercises to do, which is good preparation for the exam but also overwhelming at times. Definitely one of the more time-consuming subjects of the first semester.HS22",
        "Great course, was my most liked one in the first Semester, although it was sometimes a bit unorganised (for example accidentaly publishing solutions instead of exercises or wron exercises). Especially Plüschel is a great lecturer and the content is really interesting.",
        "Both professors do an amazing job, the topics are very interesting and taught in a way that helps you understand them. Especially Professor Püschel is displaying a MasterClass of a lecture, approaching the lecture from a standpoint where it is made certain that people are reassured that things take time to understand and that the topics are not trivial. The exercises accompany the class well and I found them helpful. Professor Steurer shows a lot of passion and never fails to activate the class. Probably one of the best lectures I have visited in all my four years at ETH.",
        "The first few weeks are considered difficult by most, since you don't have a \"grace period\" of sorts like you do in other subjects before hard exercises appear. O-Notation and formal Induction can be tricky to grasp at first.Yet, once you reach Graph Theory, the course becomes significantly easier (and more enjoyable) in my opinion. Nearly everything apart from the algorithms presented in the first 2-3 lectures is really useful later on.Overall I quite enjoyed the course (was a TA for it later, so duh) and can only say that you should persist through the first few weeks - it'll get better with time.HS20"
    ],
    "Soccer Analytics": [
        "The main part of this course is your project, which was done in a group of 5 in my case. Your group will be assigned a match and will have to analyze it based on the lecture content. The lectures themselves are usually pretty late and in my opinion can by skipped. You can find a lot of inspiration for your project from other groups since everyones work is visible and the grading is very lenient (though this is somewhat dependent on the TA you are assigned to). ",
        "I enjoyed this course a lot. You get a competition World Cup / Eurocup and are supposed to write a technical analysis report with your team. I think one can get by with little effort but you can learn a lot of practical data science and machine learning by actively participating. The teaching staff is very helpful and supporting."
    ],
    "Machine Learning Seminar": [
        "Probably one of the best seminars you can take.V. Boeva and E. Krymova are both very easy going people.The seminar consisted of 3 Saturdays Mornings instead of weekly lectures. We even got croissants !!!In the beginning we got a list of about 25 papers from which we could choose our favorites and pretty much everyone got at least one of the chosen papers. The papers themes were     Optimization & Learning, Natural Language Understanding, Generative Models and Miscellaneous.Additionally to the 3 Saturdays there were also 2 meetings with the prof to ask questions or get help in general and feedback. (both were over zoom 30min each)The presentation itself was 25min with 5min discussion (aka answering questions). Additionally asking questions is encouraged.The grading was very generous and all in all it was a nice experience and interesting seminar!",
        "This seminar was a lot of fun.Gunnar and Valentina are very easy-going and helpful professors.They do however expect a lot from you and it's probably going to be more work than you expect for 2 credits.I saw it as a learning experience and thus it was well worth it.I got a very thorough understanding of my paper and related topics and also learned a lot from my classmates presentations which were all amazing."
    ],
    "Visual Computing": [
        "I heard some not so good things about the course and while the slides are all over the place and the lectures alone definitely wont make you pass the exam I ended up learning a lot of fun stuff while studying for the exam. It was also quite nicely motivated by Prof Gross",
        "A fundamentally interesting course, somewhat hampered by the lack of lecture-exam overlap.The content is very engaging, especially the computer graphics part. The optional programming exercises serve as a good motivation to why what you're taught is useful or important. Sadly, the lecture slides are pretty lacklustre, with plenty of low-res screenshots or misrendered LaTeX. The Computer Graphics part was undergoing major changes this year, as the professor changed, so I can somewhat forgive that.The exam sadly feels quite disconnected from the lecture. Some things are never brought up in the lecture, only in one exercise session yet are a fundamental part of the exam. Furthermore, in the lecture you look at concepts, while the exam expects a lot more calculations from you. Check the old exams and be sure to know what to expect.",
        "This course serves as an introduction to the Computer Graphics and Computer Vision areas (without ML). It really is an overview of those areas and thus the content of many topics is relatively shallow. Nevertheless, I think that it’s an interesting area and this course gives some insight into the area which then might help you figure out which courses (or even major/minor) to take in your master. The exercises are mostly for-fun exercises that would allow you to explore various fancy stuff related to the course content but they are optional. If you had extra time, they could be very cool to work on. The exercise sessions introduce additional content. The quality of the lectures sometimes also left some room for improvement but overall, I still highly recommend taking this course. It also does not have any prerequisites and is generally very feasible without much effort.HS20",
        "Computer Vision is one of the most interesting topics to me and I was very excited for this course even though I do not care so much about Computer Graphics.Unfortunately, the first part (CV) was a huge letdown. The professor does not care about teaching and he does not care about you knowing it. This at this point is well known from his other courses too.Additionally,Questions were left unanswered in the forum for the whole semester and issues (like recordings, mistakes etc) were ignored.On the bright side, Prof. Coros is great, as mentioned I did not care and am not particularly interested in computer graphics. I was, however able to enjoy his lectures and learn a lot from them. I am still not that interested but I enjoyed his lectures.The exam was not too difficult but very long. Some of the exercises are pretty fun."
    ],
    "Einführung in die Cybersicherheitspolitik": [
        "I did this course last year (FS21) when I needed to harvest my GESS ECTS points. The subject is mainly talking about politics and is not significantly related to the technical part of cybersecurity. The only scratch we had with technical stuff was the second lecture talking a little bit about the CIA (Confidentiality, integrity, and availability). The rest was analyzing incidents that were affected by the cyberattacks (Zero-days, hackers invading some systems and what kind of consequences we can have, what type of political movement can be created if cyberattacks occur, etc.) concluding from them. During the semester, there are two assignments to do to be eligible for the exam. One was an assignment submitting a report on a film we had to watch. The second assignment was a group assignment, and you had to finish one intelligence report and a policy response with your group. Every attendee would be divided into a group of 4, discussing policy response to some make-up incident (e.g., I had the problem with hackers hacking into hospitals with the database. You're a member of EU, what should you do, etc.). The open book exam lasted 1h30min and was separated into a single-choice, multiple-choice, and text form, similar to an exam in Kanti because the questions are written in german. Questions are not very hard to solve but require some understanding of the literature provided in the course. Without them, it is also possible to pass (merge all literature into a single pdf and ctrl + f). If you're interested in politics and why cybersecurity is essential based on politics, I'd recommend taking the course. "
    ],
    "Entrepreneurial Risks": [
        "A Prof that knows a lot in his field and tries to stay relevant and up to date. If you watched all the lectures (no other preparation) the course is quite manageable. The prof was able to provide appropriate recordings to watch everything at a suitable time and pace to make this aspect easier. In Spring 21 (Covid Semester) the exam was online (Moodle), open book. Like most GESS, I did not hear of any failing grades, but it's not a guaranteed 6 either."
    ],
    "Einführung in die Programmierung": [
        "A super cool and nice professor. The lecture is a bit boring and slow, but some needed that speed so it was quite okay. Java was definitely useful for other courses too, and if you don't have any coding experience (like I had), it is designed exceptionally well to follow the information.Exercises and lessons were done great too, fitting difficulty and very tied to the course itself. The exam was not too hard, but that 100% reflects on how much you did during the semester. It is not hard, but it still needs a lot of time to get right.HS22",
        "It can be difficult without prior coding experience. The key is to practice a lot of EBNF and old programming exam questions. The subject can also be very rewarding. In my opinion, it is one of the Subjects where a very good grade is achievable for everyone with enough practice.   HS22",
        "The content of the lectures is mostly easy & understandable, though some concepts require further practice. There are also a lot of exercises to practice on during the semester and in past exams. However, the exam can be a bit luck-based, as the programming exercises in the exam (that count towards the final grade a lot) vary in difficulty. Do not underestimate the programming part & make sure to practice similar, past programming tasks, especially if you do not have that much programming experience.HS22",
        "Given some very basic programming experience (Python) this course gave a good introduction to Java, with tendency to touch broader programming aspects (types, recursion, iterators; EBNF, Hoare logic)The programming part felt boilerplate-heavy at times, and I missed preparing for the written part of the exam, but otherwise a perfectly fine course.HS21",
        "Don't underestimate the course, even if a lot of people (who already have some experience with java) say it's easy.",
        "I did a java course beforehand on codecademy.com and I really recommend doing that or something similar (I had no coding experience before). The prof obviously does talk about syntax too, but it just made it easier for me personally that I already knew the syntax and could focus on the concepts. ",
        "I can't stress enough that one shouldn't underestimate this lecture. It seems so nice and easy in the first few weeks. Make sure that you do the exercises and solve them by yourself without help if possible. My perspective might be a bit skewed since in our year (HS21) this subject had the lowest average.HS21"
    ],
    "Wie frei sind wir? Philosophische Theorien über Freiheit und Determinismus": [
        "Even if you have zero prior experience or knowledge of philosophy (like me) you can totally do this course. It's a lot more logical approach to philosophy than I expected but I think that's a good thing. To pass you either write an essay or do a presentation. You are given more than enough time do write the essay and it's only 7-9 pages. The professor is really nice and even gives you the opportunity to hand in a fist draft. "
    ],
    "Seminar on Media Innovation": [
        "The Media Innovation Seminar is a seminar with topics in areas such as Natural Language Processing, Virtual/Mixed/Augmented Reality, Machine Learning with Audio/Video, Recommender Systems, Social Data Analysis and more. In other words, there's a wide range of topics available. Many of the papers are recycled every year so will usually not be presenting the most recent, most unreviewed papers. In the first weeks you can assign priorities to the available papers and you will then be assigned a paper based on your preferences. You also get a tutor whom you can ask questions about the content or can ask for feedback for the presentation draft - but you don’t have to do any of that. You have to be present basically every time and in one lesson, you will present your paper. For the other sessions, you just need to read those papers and write an abstract and hand that in. You’re also supposed to participate by asking questions. Overall, this seminar is definitely a good option. There are interesting topics, the organization is okay and the required effort is relatively low.HS20",
        "The subjects are very interesting, they talk about various stuff that has to do with Media and Machine Learning:- Natural Language Processing- Visual stuff like Augmented Reality- Recommendation algorithms- BERT which basically is a model that takes a text and gives a summary of it (also used on google when u google something and there is a small text what it is at the beginning)- and much moreEach week there are 3 people presenting a paper, you have to read them each week and give a short summary about them (like really really short its about 300 characters or smth like that), involves some work but is doable, you can also just read the abstract and conclusion (not that I did that höhö) :PThen, once you are a moderator of a presentation, which means you'll have to read a paper more carefully and then ask the guy who presents questions and \"moderate\" the discussion (takes place after each presentation), which was basically always something like: \"Does anyone have a question? No one? Aight then I have a question for you....\"And then there is a paper that you have to present (which you can choose which one you'd prefer to present at the beginning of the seminar).I found the papers quite difficult tbh, they assume you have quite good knowledge about Machine Learning and they throw stuff and formulas at you that they think are obvious but I had lots of trouble understanding it.Nonetheless it is doable, you just once have to invest some time to really understand what the paper is about and do a good presentation on it. You also have an assignt expert that can help you if you have questions etc. Mine was very helpful, we went through the presentation together and made sure I understood everything I talked about.All in all 7/10 would do it again."
    ],
    "Didactic Basics for Student Teaching Assistants": [
        "You cannot choose this course. If you are a TA for a subject offered by D-INFK, you'll have to take it. The course is very easy. You have to do some self-study over a few topics related to teaching and then write about what you learned in various forums. You also have to peer-visit another TA and give them feedback, which I found really useful. Finally there's an afternoon-long wrapup session which consists of you \"teaching\" things to others they probably already know and otherwise not doing much.HS21"
    ],
    "Technology and Policy of Electrical Energy Storage": [
        "I've found this course fairly interesting. I was a little overwhelmed with the chemistry side of the course. In particular there were a lot of readings for this part of the course. At the beginning I was under the impression that they were required. The complexity of the readings combined with their length I eventually stopped reading them altogether. It turned out that they weren't really important for the exam after all. For the most part the necessary information was on the slides. The policy side of the course was a lot easier to understand and follow. The exam was in person during the first week after the semester on Moodle and had a variety of multiple choice and text answer questions."
    ],
    "Shape Modeling and Geometry Processing": [
        "== Format ==I took the course in 2022, so don't know my final grade yet. It is a semester-only course with graded assignments. The grading was done manually, as far as I can tell, and they looked at the submissions in more detail than I would have thought possible and gave feedback on the conceptual mistakes apparent in the code.I find it generally hard to tell in graded assignments at which point it is safe enough to stop polishing it (or maybe safe enough to skip some tasks that don't work after days of debugging) for a reasonable grade. This was also the case in this lecture. So I spent every two weeks roughly one week on the Shape Modelling lecture alone. Apart from the time requirement and the being stuck for hours debugging the same error, the assignments were fun and generally applicable.== Content ==The topics were new to me and not covered in the Bachelors. I could draw some knowledge from the Mathematical Foundations in CG lecture but that is imo not required at all.We had to use libigl, an ETH-maintained c++ library - and not even the latest version of it. There were bugs in that library that caused wrong behaviour and failure to compile. Building it correctly on windows was tricky. The library is also not well-documented and several times I wished I had read their source code from the start instead of relying on the comments in the header file.Topics of the assignments were:* Shading* Implicit Surfaces from Point Clouds* Mesh Smoothing* Parametrizing Meshes, Distortion of Textures* Deforming a mesh by moving the handles around* Skeletal Animation"
    ],
    "Discovering Management": [
        "The course is split in half. First 7 weeks there are lectures by different lecturers on a variety of topics. The second half is dedicated to three case studies. The work on these studies was done in rather large groups (I was in a group of 6 people). The case studies are 30% of the grade. The other 70% coming from the exam. The case studies didn't require too much work for a good grade. As preparation for the exam, reading the slides once was more than enough."
    ],
    "Introduction to Neuroinformatics": [
        "The course is pretty unrelated to anything. While certain stuff is incredibly interesting, most stuff is simply not applicable to anything. Some stuff is actually quite hard to follow imo. They assume you know quite a bit about physics and circuits already and don't teach you too much about that. However for the most part they will simply scratch the surface of certain topics. This can be kinda frustrating, because you don't really understand a thing. Also don't ignore that this course is pretty much 50% biology. This means looking at how stuff works BUT ALSO looking at how stuff is called which is incredibly boring.The workload in the semester is basically non-existent (for 6 credits...). Only 2hours of lecture and 1hour of exercise per week. The exercises and slides are all copied from last year - meaning you can just presolve stuff with solutions which makes the course even simpler. Additionally the exercise session can easily be skipped, especially if you solved the exercises already and understood it.Don't underestimate the amount you have to study for this subject tho. If you really want to understand the things and actually want to learn some of the biology and physic stuff this will take quite a while. However, the exam is quite unrewarding for studying. Most questions are about common sense. For example you have to literally interpret some graphs or eliminate obviously wrong answers. But the exam is also incredibly difficult to be good in. This is mostly because the other type of questions are as random as questions can be. They will ask you about definitions that never were fully given. They will ask you about random fact that they may or may not have said in the lecture etc. Also the exam basically didn't require any kind of calculation or sketchs and we had waaaaaay too much time.Also, there were no old exams etc... and even if there would have been some old ones, I doubt they would've helped to prepare us for the randomness of that exam.",
        "This isn't about the machine learning Neural Networks.The course offers a detailed view of the human brain, neurons and how computations in the brain happen and can be modelled. The course is overall not very demanding, although if you wish for an excellent grade you'll have to study a lot more by heart than what is typical for ETH. If you're only here for the credits, well, the exam is multiple choice without negative points, and most questions can be eliminated to a 50:50 by common sense.In my opinion, it's an interesting course in that it is very different from almost everything else you'll see in the CS curriculum.",
        "Introduction to Neuroinformatics is a course about biological neurons. If you’re looking for a Neuronal Networks course, that’s not the one. This course covers the anatomy of brains and neurons, the physical mechanisms of the neurons and towards the end also some abstractions to model biological computation. So the first part is really biology and the last few lectures are more about computer science related concepts. This course is overall relatively easy to follow. The topics are mostly covered on a high-school level. So they can be somewhat interesting but the individual concepts are not really hard to grasp. Furthermore, this course is split up into multiple somewhat connected parts taught by various lecturers. So if you should dislike a single topic/lecturer, it’s nothing you have to endure for the entirety of the course. Unfortunately, it’s quite unlikely that you’ll be able to do anything with this course though - there are basically no other courses in this direction unless you’re planning to switch to UZH.The exam is multiple choice which means that you can pass this course with good guessing. Unlike with ETH courses, you might have to learn a couple of things by heart for this course if you want to get a very good grade.  HS20",
        "Very free credits. The exam is only multiple-choice questions and the exercises aren't really relevent much. Most of it is just knowing things by heart, but a lot of questions can be solved with little knowledge just by eliminating obviously wrong answers.The topics are generally interesting though sometimes very detailled. There's also a wide range of different topics and not all are equally interesting. Most of the lecture is biology where you learn about the brain and neurons/synapses, so I'd recommend it only if you have some interest in biolgoy. The exercises are imo not very relevant to the course (I only did the first few and it was fine) and it's only 2 hours of lecture per week (+1 houre for discussing the exercise, but this can be skipped), so this subject consumes very little time during the semester. There are a bunch of different lectures for this course - some good, some bad - so don't abort just because there's a bad prof at the start."
    ],
    "Network Analysis": [
        "The course is usually very late, which makes it hard to stay focused especially when (imo) the content was not very interesting. However, the midterm (which just gives a bonus and is not necessary) and the final are very easy and are usually just a recycled version of previous exams. Would recommend simply for the free ects.",
        "As a Computer scientist:I'd say this is a very basic introduction on how to apply more complex ideas to social science, if you are interested in that definetly a must have.Otherwise it isn't very deep (since it is a GESS) and only gives you a broad overview, tho very interesting to see how that works. Some of the algorithms like page-ranking you will encounter again.In General the Effort is not very high, attending the lecture is usually enoughSadly there is almost no possiblity (or it's very unhandy) to do something extra or doing something on your own, since it is very Theory based.As usual in GESS it is more about concepts and not about proofs.(Even tho it the concept are completly mathematical models)",
        "In my opinion one of the most boring subjects out there. But quite easy to get a good grade, since the exams on Moodle are pretty much recycled and the in person exam was very similar to the one provided. The script pretty much covers the entire lecture which essentially means that you don't have to go to any lectures. However the lecture slides are sometimes somewhat confusing and the lecture itself is afaik always late...While its a boring course one cannot deny that you will actually learn a thing or two which is good for a gess course I guess?",
        "This course is a GESS course about Graph Theory with a focus on concepts that are relevant in social networks. So it’s a course that’s made for all possible study programs about a topic that’s quite central in CS. Some of the concepts are quite interesting. However, the lectures are quite late and combined with long explanations, it can sometimes be quite hard to focus. The material provided is unfortunately rather lacking in quality. A big issue is also the similar (or overlapping?) notation used for various concepts and the notation definitions are also sometimes lacking or missing. However, this course is still okay and feasible so if you’d like to have a bit more Graph Theory, it’s definitely a viable option.HS19",
        "The lectures are interesting with a lot of practical examples. However they took place in the late evening from 18:15 to 19:45 (without a break) which isn't ideal if you want to stay awake and be able to focus. I would recommend watching the recordings instead.",
        "The exams are pretty much the same as lat year (for us in winter 2021). So I m satisfied that I got good grade, but the lectures are very boring... and can be hard to learn for if you don't have access to last year exams",
        "You have some graph knowledge to learn in the course and the exam is not very hard imo. But the lectures are not very interesting and I don't think people will not fall asleep when the lecture time is in the late afternoon (which was the case with me). For the exam, you have one old exam to prep and you don't have any exercises; on the one hand, less to do, on the other hand, it's hard to expect what will come in the exam. We had 3 tasks in mid- and 6 tasks in the endterm. Each task weighs 10P and the best 6 tasks will be counted as your grade by dividing the sum of gained points by 10. If you want to learn how to use graphs to solve some real-world problems, go ahead.",
        "You will encounter a few topics again which have been covered in A&D and A&W plus some more graph related stuff. It can get a bit boring at times but despite that you could do some pretty interesting data analysis with it. The exam is also really favourable. The 6 best tasks from the mid and end term are taken and if you for whatever reason still failed they won't forward the grade so the fail wont even show up (at least thats what they did when I took it)HS20"
    ],
    "From Cotton to Cocaine: Commodities That Made History (c.1700-1950)": [
        "10/10. Very low effort class, only need to write one essay which doesn't get graded(pass or fail) to write the end exam. The grading at the end exam is quite harsh, i wish i had studied more for it.",
        "Lots of really interesting history factoids. The idea of the lecture - tracking commodities and thereby learning about the surrounding history - is brilliant. If you enjoy history, you'll likely enjoy this subject (if it is ever offered again). The exam is rough, apparently quite a few had to re-take it. (I suspect the main issue lies in the fact that you're supposed to write history exams with essays again after having done only MINT exams for a while.) HS21"
    ],
    "Menschliches Lernen (EW1)": [
        "This GESS subject is useful for those those that plan to do the Lehrdiplom in the MSc, since you apparently can then count these 2 credits towards the Lehrdiplom again.The course gives a broad overview of how we learn, which in itself is quite interesting. There is little actionable information, it really is more designed to be a theoretical overview. The lecture isn't particularly engaging; especially for a subject that is literally about how to teach well the overuse of PowerPoint slides isn't a good thing... However the concepts taught are surely useful for the later EW courses and the exam isn't too hard.HS21"
    ],
    "Computing Platforms": [
        "From what I've heard, one of the easiest seminars you could take. You do a presentation once, and otherwise you just have to be present in the room. Supposedly they also grade you on the quality/quantity of questions you ask after another person's presentation, but I never saw them take any notes on any person's \"activity level\" (actually they themselves were sometimes on their phones during a presentation). One thing I didn't like is how intransparent they are with their grading process. You get your grade at the end of the semester with 0 explanation or room for discussion. The effort required depends a lot on what research paper you present. Here you can mark preferences but ultimately who presents which paper is somewhat random. How much did I learn? Not that much tbh. The seminar was very helpful to push myself to finally learn more about cloud computing, and I learned a lot from the paper I presented. However most of the presentations were not great and very hard to follow, so beyond my own paper I didn't really learn anything.Recommended for: you just want to check \"doing a seminar\" off your todo list.",
        "The seminar has a very standard format - you do one presentation in pairs, there are two presentations each week. No poster, no separate day for presenting, no assigned mentor or anything of the sorts. I liked that simplicity.The papers presented were generally interesting; especially if you enjoyed SPCA and like hearing about how real-world systems (e.g. DBs used at Google) work. I would probably not take it in 3rd semester, but after SPCA you should be fine in terms of required prior knowledge.FS22"
    ],
    "Systems Dynamics and Complexity": [
        "Sometimes extremely boring, mostly management focused (not actually solving problems, just talking about it), You need to work on three (quite tedious) projects during the semester. Semesterend exam but it was on the very last day before the actual exam session began. You will end up studying and working a lot for 3 ETCS and an average grade."
    ],
    "Optimization Methods for Engineers": [
        "In the first half Dr. Smajic introduces a few basic optimization methods. This part of the course is really interesting although somewhat superficial. In the second half you can work on a project in groups with up to 3 people. You can choose basically any topic you want as long as it has something to do with optimization. In the end every member of the group has to present  the project alone. The oral exam is less of a presentation (as suggested by the lecturers) but more a discussion of your project. The grading is really generous. The only complaint I have is that the organization seems rather chaotic  FS22",
        "The first 6 weeks are lectures about optimization methods. Those are interesting and the lecturer Jasmin Smajic presents them well. In the last lecture, Dr. Smajic was supposed to answer questions about the project of the second half of the course, but this somehow didn't happen. You have 8 weeks in the semester (aka the 2 lecture hours) to work on the project you have to present in the exam phase to get graded. The only other guide lines you get is that you can do it in groups of 1 to 3 people.Summary: The course is interesting, I definitely recommend taking it as Ergänzung if you're interested in mathematical optimization, but more information/guidelines on the project would have been helpful"
    ],
    "Energy, Resources, Environment: Risks and Prospects": [
        "This course has a single 4 hour lecture block per week. That's long - very long. The two profs try to mix things up and there's usually at least one big discussion that tends to go off-topic into whatever topic the group feels like talking about. Yet sometimes it still was difficult to pay attention all the way through; luckily the content from the lecture aren't specific facts or similar that you have to learn, but concepts from economics & ecology which you can apply in your project.With regards to the project, you're able to do nearly whatever you want, as long as you can somehow tie it in with the lecture. This flexibility allows you to choose a topic that really interests you, but it also makes it more difficult to pick something suitable.The effort required to pass isn't very high for the 6 credits you get. You surely can put a lot of time into your project if you want to though. I liked the course because it was something totally different from any other course I had taken and I was really interested in the topics, but I would probably advise you not to choose it just for the cheap credits if you do not have any interest in the subjects covered - the 4 hour lecture and the project will become a drag then.FS22",
        "If you like discussing environmental, political and sometimes even philosophical topics this course is perfect for you. You don’t have to visit the 4h lectures but I can only recommend you do. They areheld by two lecturers who, at times, have very different world views. As a result the lecture feels a bit like a podcast (in a good way). After they are done presenting their views and thoughts they will usually open up the discussion to the class.At the end you will have to write a paper in groups of 3-5 students and then present your findings to the class. You get to decide pretty freely what you want to write about.All in all one of my favourite courses I’ve taken at ETH so far! "
    ],
    "Physik I": [
        "Great course to take along 3rd semester courses, especially Analysis 2. Content is interesting and not too hard, and to have live experiments in a lecture is something you won't really get to see in CS otherwise. It's a first semester course for physics&maths students, so you'll find lots of additional material and help available. The work you need to put in for those sweet 7 ECTS is not that much, actually.I'd really recommend the course to people looking for an Ergänzungsfach"
    ],
    "Mathematik III: Systemanalyse": [
        "As a Computer Scientist:Generally an not so hard Subject with Analysis I done.For people with a \"mathematical\" background it will be more like a \"Physics\" still lecture this means for the level it is a lot more intuition and no proofs than what you have in Analysis II.I think it is a lot more interesting to see some application of Analysis in other fields of science than computer science, so I would definetly recommend.If you like more classical math probably a lecture like Analysis III form I-TET is more fitting.",
        "This course is generally considered to be easy. Despite this being a math course, its main focus lies on building a model and then interpreting the results, not on how to get to the result.The topics covered in the course are reasonably interesting, with practical applications such as climate models or nuclear disasters being looked at. All the lecturers are pretty decent too and care about the students.HS22",
        "Math 3 is a math course for D-USYS, D-HEST and D-ERDW. However, as a CS student you can take this as a minor course - if you do the TA didactics course during your bachelor, this course is a great addition as it allows you to complete the minor category. Technically, it builds on differential equations (Analysis 2 content) but you won’t have to solve any differential equations for the exam. This course is about applied differential equations. Various environmental issues are abstracted using models and then analyzed. During the lectures, the formulas are derived; in the exercises and at the exam, you’ll just have to plug in formulas. I personally chose this course mostly because I needed to get the minor credits but it turned out to be a quite interesting course actually. And as it’s also very easy, it’s very enjoyable overall. The lecturers are also pretty good. So I can definitely strongly recommend this course.HS20",
        "(DINFK Minor) You need some Ana 2 knowledge, but still no problem to take it in the 3rd semester. You can use a cheatsheet where you can basically write all formulas down which you have to use.The content is also interesting, and the exercises reminded me a lot about highschool math exercises i.e. Questions with a Story.HS21"
    ],
    "Advanced Topics in Mixed Reality": [
        "Topics are very interesting, all you have to do for this course is to prepare your presentation after reading one main paper and some relevant ones and being attentive in other's presentation. I can very recommend it since it's really not much and also has a lot of interesting papers. The only cons is that after a while topics of the papers start repeating and it gets a bit boring. ",
        "FS22",
        "Its a good seminar. most papers are interesting and from what I hear its not much more effort than most other seminars.you present a paper for 20 minutes and lead a discussion for another 20 minutes.Your grade is based on the presentation, participation in the discussions and the poster about your paper (basically a short summary)FS22"
    ],
    "Das Persönliche und der Computer. Zur Geschichte des PC": [
        "Its more about the social aspects surrounding computers. While you look at some computer history stuff its not the main focus of the course. That being said its pretty easy to pass with writing two texts and a participation grade.FS21"
    ]
}